{"sessions":[
 { "title":"Getting to Know 2-3-98","date":"10-Jun-2012","time":"9:00 AM","room":"Tower 1401","track":"Awareness and Advocacy","level":"All","type":"Administrator/Executive","presenters": ["Masson, Patrick"],"details":"How are your Provost, CFO, Deans and Faculty involved in the open source initiatives underway on your campus? Too often participation in \"open source projects\" is limited to technical staff focusing on technical issues. However as technical services permeate the campus, enabling many of the mission critical services vital to these constituents, \"users\" should become not only \"stakeholders\" but ideally \"contributors.\"  The 2-3-98 Project provides support for college and university administrators, managers, and practitioners wishing to better understand the value proposition of openness (as an organizational and operational orientation) and open initiatives, in order to increase choice. Drop in throughout the day to The 2-3-98 Project \"Open House'\" and learn more about the activities underway, how to participate and opportunities for non-technical participation back on your campus. No previous registration is required.\r\nAdditional Fee: No"}, { "title":"An Introduction to rSmart Academic: A Sakai OAE and CLE Platform","date":"10-Jun-2012","time":"9:00 AM","room":"Tower 1404","track":"Teaching, Learning, Portfolios and Research","level":"All","type":"Instructional Design","presenters": ["Angell, Nate","Harris, Trish"],"details":"This full-day workshop will provide people interested in open pedagogy a range of story-based entry points to rSmart Academic. The workshop has two parts: an overview that includes functional, technical, and vision details; and a hands-on, story-based experience design construction workshop. Experience designers will expose and demonstrate a range of possible designs through the development process, from learning problem to design to creation and then user testing. Faculty, course designers, project managers, students, and technical staff will benefit from this workshop.  \r\n\r\n    Why rSmart Academic?\r\n    Finding Your Way in rSmart Academic\r\n    Stories\r\n    Technical Overview\r\n    Future Directions\r\nAdditional Fee: No"}, { "title":"A Showcase of Open Source Portfolio Implementations","date":"10-Jun-2012","time":"9:00 AM","room":"Tower 1403","track":"Teaching, Learning, Portfolios and Research","level":"Beginner","type":"Instructional Design","presenters": ["Smith, Janice","Ward, Lynn"],"details":"Open Source Portfolio (OSP) community members will demonstrate institutional implementations of the portfolio tools in Sakai 2.8 and 2.9, including enhanced assessment capabilities, simplified portfolio templates, and the latest reporting techniques. Panel members will share actual user scenarios illustrating innovative ways to customize the portfolio tools in Sakai, as well as provide technical instructions and access to each innovation. Portfolio users at all levels of expertise will benefit from this session. Outcomes include expanded knowledge of possible ways to implement portfolios in Sakai, skills and resources for applying the innovations described, and enhanced networking among institutions using OSP. Institutions, organizations, and vendors planning to participate include Indiana University and Three Canoes LLC. Other institutions will participate based on the availability of funding to attend the conference.\r\nAdditional Fee: No"}, { "title":"Delving into Bedework","date":"10-Jun-2012","time":"9:00 AM","room":"Tower 1405","track":"Getting Started","level":"All","type":"Development","presenters": ["Leibson, Barry"],"details":"While interacting with a live instance of Bedework, explore the various pieces that make up the calendaring platform - including backend servers, web clients, and the calendar feed/widget builder - and discuss ways in which Bedework is being used.\r\nAdditional Fee: Yes"}, { "title":"Adopting uMobile","date":"10-Jun-2012","time":"9:00 AM","room":"Tower 1407","track":"Getting Started","level":"Beginner","type":"Mobile","presenters": ["Bourey, Jennifer"],"details":"uMobile introduces a higher-education focused platform for delivering authenticated, personalized content to mobile devices. Core features enable integration with campus directories, calendars, and learning management systems, as well as provide useful mobile tools such as maps. The use of web-based technology allows universities to work in a familiar development environment, while open APIs (Application Programming Interface) and standards-based implementations enable integration with diverse university data sources. Role-based content distribution allows universities to target diverse communities such as students, staff, visitors, and alumni with relevant content.\r\nLearn how to power your campus with uMobile in an interactive atmosphere. This session will cover all facets of adopting uMobile, teaching participants how to quickly bring personalized mobile apps to their campus. Participants will learn how to:\r\n    Install and configure uMobile\r\n    Expose data to out-of-the-box uMobile modules\r\n    Easily create custom mobile content\r\n    Deploy and publish native apps\r\nAdditional Fee: Yes"}, { "title":"Sakai OAE Management and Deployment","date":"10-Jun-2012","time":"9:00 AM","room":"Tower 1406","track":"Deployment and Integration","level":"All","type":"Development","presenters": ["Whitney, Max"],"details":"This half day technical workshop provides attendees with hands-on experience with the latest release of Sakai OAE. Participants will install, configure and customize OAE on their own laptops. Topics covered will include: creating users interactively and at the command line, creating courses, customize the look and feel via institution specific CSS styles, modifying display text, establishing institution wide categories, modifying drop-down lists, localizing the interface. Participants will come out of the workshop with an understanding of the various layers at which OAE can be customized. Depending upon the level of expertise of participants the workshop may also provide integration to a demonstration instance of LDAP and deployment on a PostGres SQL database backend. This is a half day seminar offered twice.\r\nAdditional Fee: Yes"}, { "title":"Sakai CLE Implementation Bootcamp","date":"10-Jun-2012","time":"9:00 AM","room":"International E","track":"Deployment and Integration","level":"Beginner","type":"Support","presenters": ["Zeckoski, Aaron"," Jones, Matt","Horwitz, David","Swinsburg, Steve"],"details":"This half-day seminar will focus on installing and integrating with Sakai CLE for system administrators, developers, and technical support staff. This will be an introduction to Sakai CLE and will cover the following topics:\r\n- What is Sakai CLE\r\n- Brief history of Sakai CLE\r\n- Installation gotchas and tips\r\n- Basics of branding\r\n- System configuration\r\n- Sakai admin tools and basics of site setup and management\r\n- Authentication and user lookup\r\n- Installing contributed tools and plugins\r\n- Integrating with other systems (Basic LTI, SOAP Webservices, REST)\r\n- Managing local code changes and customizations\r\n- Basics of Sakai development (code structure and conventions)\r\nParticipants will be exposed to everything they will need to basically install, customize, and support a Sakai CLE installation at their institution.\r\nAdditional Fee: No"}, { "title":"Opencast Matterhorn Technical Workshop","date":"10-Jun-2012","time":"9:00 AM","room":"International B","track":"Expanded Solutions","level":"All","type":"Media/Multimedia","presenters": ["Hancock, Mara","Ziegmann, Michelle"],"details":"Opencast Matterhorn is a free, open-source platform to support the management of educational audio and video content. Institutions use Matterhorn to capture and produce lecture recordings, manage existing video, serve designated distribution channels, and provide user interfaces to engage students with educational videos.\r\nIn this pre-conference workshop, participants will be introduced to the Opencast Matterhorn project and the technical architecture of the platform. The workshop will begin with an overview and history of the Opencast community and Matterhorn and will then focus on customizing and integrating Matterhorn with other campus systems and online learning technologies. An emphasis will be placed on helping potential and current Matterhorn adopters engage and participate in the Opencast community.\r\nAdditional Fee: Yes"}, { "title":"Implementing uPortal 4","date":"10-Jun-2012","time":"9:00 AM","room":"Tower 1402","track":"Deployment and Integration","level":"Intermediate","type":"Development","presenters": ["Wills, Drew"],"details":"In this seminar we will take a deeper, hands-on look at the latest uPortal 4 release. We will cover real-world topics related to implementing, maintaining, and upgrading uPortal; the material will be valuable both to those learning uPortal for the first time and those who expect to migrate to uPortal 4 from earlier versions. Special emphasis will be placed on newer, less well-documented subjects.\r\nYou will learn about:\r\n    Building, configuration, & installation\r\n    Themes & skins\r\n    Authentication\r\n    User attributes\r\n    Groups and permissions\r\n    Layout management\r\n    Portal administration\r\n    Data migration tools\r\n    Deploying & configuring portlets\r\nWe will discuss tips and tricks, pitfalls to watch out for, and community best practices.\r\nAdditional Fee: Yes"}, { "title":"Portlet Development Best Practices","date":"10-Jun-2012","time":"1:00 PM","room":"Tower 1405","track":"Design and Development","level":"Beginner","type":"Development","presenters": ["Moayyed, Misagh"],"details":"This seminar will demonstrate portlet development best practices using the JCR Content Management Portlet project as an example. It will highlight some of its features and contrast it with the current uPortal Simple Content Portlet. Seminar topics will include:\r\n    Brief introduction to portlets and the latest JSR286 spec\r\n    Dev environment setup & debugging: uPortal, Eclipse, Tomcat, Maven, etc.\r\n    Tools, Libraries: Spring Portlet MVC, jQuery, Jasig Ajax Library, ResourceServingApp\r\n    Portlet events in conjunction with the uPortal search API\r\n    Best practices in portlet development around Jasig\r\nAdditional Fee: Yes"}, { "title":"Adopting Opencast Matterhorn for Educational Video","date":"10-Jun-2012","time":"1:00 PM","room":"International B","track":"Expanded Solutions","level":"All","type":"Media/Multimedia","presenters": ["Hancock, Mara","Ziegmann, Michelle"],"details":"Opencast Matterhorn is a free, open-source platform to support the management of educational audio and video content. Institutions use Matterhorn to capture and produce lecture recordings, manage existing video, serve designated distribution channels, and provide user interfaces to engage students with educational videos.\r\nIn this pre-conference workshop, a series of lightning talks will highlight active Matterhorn-related projects and new features in development, as well as implementation scenarios and research projects from within the Opencast community. An emphasis will be placed on helping potential and current Matterhorn adopters engage and participate in the Opencast community.\r\nAdditional Fee: Yes"}, { "title":"Customizing the Open Source Portfolio Tools in Sakai","date":"10-Jun-2012","time":"1:00 PM","room":"Tower 1403","track":"Design and Development","level":"Intermediate","type":"Development","presenters": ["Smith, Janice","Ward, Lynn"],"details":"Open Source Portfolio (OSP) community members will provide technical training for customizing the portfolio tools in Sakai 2.8 and 2.9. Specific attention will be given to innovative uses of forms and form renders as well as portfolio templates. Outcomes for the training include acquiring the basics in customizing forms and portfolio templates in Sakai for different purposes, and understanding how form renderers can enhance the use of forms. Participants should have an intermediate level knowledge of portfolios, a basic understanding of XSD and XSL, a computer with an XML IDE installed, and a Sakai instance to work on. Institutions, organizations, and vendors planning to participate include Indiana University and Three Canoes LLC. Other institutions will participate based on the availability of funding to attend the conference.\r\nAdditional Fee: No"}, { "title":"Skinning uPortal: For Developers","date":"10-Jun-2012","time":"1:00 PM","room":"Tower 1402","track":"Design and Development","level":"Intermediate","type":"Development","presenters": ["Polizzotti, Matt"],"details":"There's more than one way to skin a cat. This expression refers to removing the very tough skin from the delicate flesh of a catfish. There are many ways to skin a catfish and all were initially developed through trial and error in an attempt to find the best way to remove the skin without tearing the edible flesh into smaller bits and chunks. Like most fish, an intact one-piece half-fish fillet of catfish is most desirable for cooking (battered, breaded or pan fried). To obtain such catfish fillets, takes knack and technique. Likewise, the goal of this seminar is to refine your uPortal and uMobile skinning technique. We want to get right to the content so this seminar won't cover the installation of the portal, but we'll touch upon development environments before digging into skinning and theming best practices and debugging common skin issues across desktop and mobile platforms.\r\nSeminar highlights:\r\n    What's the difference between a theme and a skin?\r\n    How do you change the theme?\r\n    How do you change or create new skins?\r\n    What are some common skin issues?\r\nAdditional Fee: Yes"}, { "title":"Implementing CAS","date":"10-Jun-2012","time":"1:00 PM","room":"Tower 1407","track":"Getting Started","level":"Beginner","type":"Identity Management","presenters": ["Petro, Andrew"],"details":"This seminar focused on the Jasig CAS single sign-on server product will cover through lecture and demonstration:\r\n    what is CAS; where did it come from; what problems does it solve \r\n    CAS protocol \r\n    n-tier delegated authentication using proxy CAS\r\n    credential replay using ClearPass\r\n    establishing local Maven Overlay build of customizations and configurations atop the CAS server product \r\n    branding \r\n    configuring LDAP integration\r\n    services registration and management\r\n    implementing ClearPass CASifying applications, including uPortal and Sakai\r\n    high-availability considerations, including clustering the ticket registry \r\nParticipants will leave this seminar with an understanding of what value CAS brings to meet single sign-on needs and what's involved in implementing the Jasig CAS single sign-on product within a campus or organization.\r\nIn keeping with time and format constraints, this is not a hands-on seminar. \r\nAdditional Fee: Yes"}, { "title":"Hands-on with the Scheduling Assistant","date":"10-Jun-2012","time":"1:00 PM","room":"International E","track":"Deployment and Integration","level":"Intermediate","type":"Development","presenters": ["Blair, Nicholas"],"details":"Learn how to deploy an instance of the Scheduling Assistant alongside Bedework or other CalDAV capable calendar servers. Create your own overlay project and learn how to customize just the components and configuration unique for your environment. Learn about the extension points and get ideas on how to integrate your institutions business data, like student/instructor or advisor/student relationships. Attendees should have basic understanding of installing Java, Tomcat, Maven, and Ant.\r\nAdditional Fee: No"}, { "title":"Sakai OAE Management and Deployment","date":"10-Jun-2012","time":"1:00 PM","room":"Tower 1406","track":"Deployment and Integration","level":"All","type":"Development","presenters": ["Whitney, Max"],"details":"This half-day technical workshop provides attendees with hands-on experience with the latest release of Sakai OAE. Participants will install, configure and customize OAE on their own laptops. Topics covered will include: creating users interactively and at the command line, creating courses, customizing the look and feel via institution-specific CSS styles, modifying display text, establishing institution-wide categories, modifying drop-down lists, localizing the interface. Participants will come out of the workshop with an understanding of the various layers at which OAE can be customized. Depending upon the level of expertise of participants, the workshop may also provide integration to a demonstration instance of LDAP and deployment on a PostGres SQL database backend. This is a half-day seminar offered twice. Addtional Fee: Yes."}, { "title":"New Joint Collaboration - Open Source Identity Management for Higher Education","date":"11-Jun-2012","time":"9:30 AM","room":"Conference Center Room 3","track":"Leadership and Future Directions","level":"Intermediate","type":"Identity Management","presenters": ["Sublett, Hampton"],"details":"Participants from a number of organizations, including Jasig, Kuali and Internet2 have been collaborating to create a coherent set of open-source Identity and Access Management (IAM) software packages to meet the needs of Higher Education and Research. This initiative is called \"Open Source Identity Management for Higher Education\", OSIdM4HE. The activity arose in response to concerns raised by many institutions that current products, both open-source and commercial, are not meeting their complete IAM needs effectively or affordably. Technical analysis has identified requirements in a number of functional areas, including an assessment of some existing candidate open-source products. This group has also developed proposals for organizational and funding structures to support the development and the integration of the projects and products.\r\nSession will cover: Background of Initiative, Primary Objectives, Progress To Date, How You Can Participate\r\n"}, { "title":"Sakai OAE - Tasks, Assignments, Grading and Unstructured Feedback","date":"11-Jun-2012","time":"9:30 AM","room":"Peachtree Ballroom","track":"Design and Development","level":"Beginner","type":"Instructional Design","presenters": ["Peck, Sam","Matthijs, Nicolaas"],"details":"This presentation looks at the results of important workshops, interviews and usability studies, feedback and the collective work the community have been forming over the Spring of 2012. The presenters will demo various scenarios, taking attendees through tasks and assignment creation, submissions and assessment, to-do capability and tease out some ideas to grading, while proposing intuitive ways to build dialogue around unstructured feedback. At the same time the design team will look at future design refinement within a grander vision and present bolder conceptual approaches, challenging the way in we all currently see learning environments.\r\nThe OAE project team will put it all to the test (as in usability tests) and will have set up moderated and unmoderated usability research lab, calling out specifically for participants at 2012 Sakai Annual Conference to get involved in the design process and take the test straight after this presentation."}, { "title":"uPortal Users, Profiles, and Layouts","date":"11-Jun-2012","time":"9:30 AM","room":"Tower 1401","track":"Design and Development","level":"All","type":"Development","presenters": ["Dalquist, Eric","Bourey, Jen"],"details":"Come meet with the uPortal developers to go over plans and designs for re-working the user-profile-layout data model in uPortal. These pieces are important for determining how layouts map to various devices. These pieces are also one of the last vestiges in uPortal that are not using JPA2 for persistence, and refactoring them will get the project to a single coherent data model."}, { "title":"What\\'s New in Bedework 3.8","date":"11-Jun-2012","time":"9:30 AM","room":"Conference Center Room 4","track":"Deployment and Integration","level":"All","type":"Development","presenters": ["Leibson, Barry","Schwartz, Gary"],"details":"Bedework 3.8 incorporates some interesting developments, perhaps the most exciting being the new synchronization engine that underlies external subscriptions or the new display options available in the public events web client.\r\nWhile the session will concentrate on what's new, it will likely provide a good introduction to Bedework for those who are new to it.\r\n"}, { "title":"From the Sakai CLE to the OAE: Change Management at Three Universities","date":"11-Jun-2012","time":"10:45 AM","room":"Peachtree Ballroom","track":"Deployment and Integration","level":"All","type":"Support","presenters": ["Rothrauff, Lisa","Perpich, Diana","Ward, Lynn "],"details":"As you consider adopting the Sakai OAE for your campus, how will you move your campus users off their current LMS to this new environment? In this session, instructional design and technology support leaders from UC Berkeley, University of Michigan, and Indiana University take on this question and share their early plans for strategic change management as they implement the OAE. \r\nOrganized as part panel discussion, part facilitated discussion among session participants, the presenters will start with lessons learned from their previous adoption of the CLE. What expectations were set for new users? How much time was allowed for pilot testing and rollout? What was the scope of training and support needs and how were they addressed? \r\nWe will then consider these lessons and discuss how they have already been or can be applied to the arrival of the OAE."}, { "title":"Analytics - Where do we start and where do we want to go?","date":"11-Jun-2012","time":"10:45 AM","room":"Tower 1404","track":"Leadership and Future Directions","level":"Beginner","type":"Advocate","presenters": ["Sherratt, Robert","Lynch, Patrick"],"details":"Analytics is new to the University of Hull although, as we explore the possibilities, it is interesting to find a small number of faculty already considering and developing analytics applications in their departments. This presentation will review the current state of analytics in Hull and outline our thinking on the best approaches to take for the institution. There will be a particular focus on the potential models to better understand how we retain students and enable them to progress as well as discussion on the rationale and reasons for considering analytics including the benefits and value we would hope it could offer to students, faculty and the institution. We will conclude by describing plans for future implementation."}, { "title":"Developing a Dashboard for Sakai CLE","date":"11-Jun-2012","time":"10:45 AM","room":"Tower 1402","track":"Design and Development","level":"Intermediate","type":"Development","presenters": ["Eng, Jim","Fish, Adrian","Kretler, Chris","Qian, Zhen","Silverio, Gonzalo"],"details":"The new dashboard tool for Sakai CLE (Sakai 2) attempts to show users the most immediate and significant items from throughout their active sites in Sakai. The first version of the dashboard is a contrib tool that displays links to the most recent activity in Sakai's resources, assignments and announcements tools, as well as upcoming deadlines and events from the calendar and assignments tools. Similar notifications from other tools (core or contrib) can be included with a modest amount of effort.  \r\nThis panel discusses the technical challenges to presenting this sort of view to users and our approach to solving those problems. We will report results of performance tests. We will give a brief step-by-step description of the effort needed to show entities in the dashboard. And we will hear a first-hand account of adding items to the dashboard from a contrib tool."}, { "title":"Introduction to Sakai for Faculty","date":"11-Jun-2012","time":"10:45 AM","room":"Conference Center Room 2","track":"Getting Started","level":"Beginner","type":"Faculty","presenters": ["Erbes, Stella","Kha, Hong"],"details":"Are you a professor and new to Sakai? Or are you part of the tech support team and are seeking ideas for faculty development? The purpose of our presentation is to give potential users an overview of the learning management system and to share how faculty use Sakai at Pepperdine University to enhance student learning. For those who are unfamiliar with Sakai's interface, one faculty member and one tech team member will begin with a basic overview of the learning environment and simple tips on how faculty can easily adopt Sakai. We will discuss student and faculty responses to the platform, next steps for beginners, and ways to make learning possible through methods that extend beyond the walls of a traditional classroom."}, { "title":"Jasig CAS 3.5 - What\\'s New","date":"11-Jun-2012","time":"10:45 AM","room":"Conference Center Room 4","track":"Deployment and Integration","level":"Intermediate","type":"Identity Management","presenters": ["Petro, Andrew"],"details":"Review of the CAS 3.5 release, what's new, what adopters need to do to upgrade, and why to be excited about the best Jasig CAS server release yet.  This presentation will also venture beyond the 3.5 release to survey available CAS extensions and areas of opportunity for making the most of a CAS 3.5 deployment.\r\nThe primary audience of this presentation is current CAS adopters who would like to understand what's new in CAS 3.5 and why and how to consider upgrading."}, { "title":"Kaltura Video in Sakai CLE/OAE","date":"11-Jun-2012","time":"10:45 AM","room":"Conference Center Room 1","track":"Expanded Solutions","level":"All","type":"Media/Multimedia","presenters": ["Zeckoski, Aaron"],"details":"Managing media (video, audio, images, etc.) for a campus is a complex task. Kaltura provides a solution for encoding and storage of media content which integrates with many popular platforms like Sakai. Come see a demo of the new features in the Sakai Kaltura integration for CLE and the new integration Sakai OAE. We will also discuss upcoming features in Kaltura and the Sakai integrations and finally see how schools are currently using Kaltura with Sakai and discuss what needs the community might have."}, { "title":"Orienting Students to Online Learning Using Sakai","date":"11-Jun-2012","time":"10:45 AM","room":"Tower 1403","track":"Teaching, Learning, Portfolios and Research","level":"Intermediate","type":"Instructional Design","presenters": ["Means, Tawnya"],"details":"Student orientation to online courses and student socialization with other online students greatly affects success in the course or program. The University of Florida's Warrington College of Business Administration's award winning Internet MBA program includes a comprehensive on-campus orientation with team-building, conceptual review opportunities, and introduction to the technology that will be used in the program. A hands-on walk through of the hardware and software introduces students to the technology they will use during the program. Students learn how to use Sakai through practice assignments, assessments and discussion activities. The information for these sessions is contained in a Sakai course site (with the material presented in the Lessons/Melete tool to acclimate students to course sites) and is projected on the screen, thus accomplishing two purposes: 1) displaying instructions during the session, and 2) providing tutorials and information for later access and reminders."}, { "title":"Sakai QA 2011-2012: Lessons Learned and Future Focuses","date":"11-Jun-2012","time":"10:45 AM","room":"Tower 1401","track":"Technical Management","level":"Beginner","type":"Support","presenters": ["Egan, Rob"],"details":"This BOF discussion is meant to bring together the different teams who work on release candidate versions of Sakai CLE and get their input about the Quality Assurance (QA) testing process.\r\nThe goal is to talk about the previous year in terms of testing and find out what people liked, what they didn't like, and how we can move ahead for the 2012-2013 year.\r\nThis session is for all levels and those without any QA testing experience are encouraged to join."}, { "title":"uPortal Review and Roadmap","date":"11-Jun-2012","time":"10:45 AM","room":"Conference Center Room 3","track":"Design and Development","level":"All","type":"Development","presenters": ["Dalquist, Eric"],"details":"Join us for a review of the new features in uPortal 4.0 including JSR-286 support, uMobile integration, bookmarkable URLs, and more. We'll also look into the future with a review of the project's roadmap and plans for the future."}, { "title":"Open Pathology in OAE","date":"11-Jun-2012","time":"10:45 AM","room":"Conference Center Room 5","track":"Deployment and Integration","level":"All","type":"Advocate","presenters": ["van Leeuwen, Rob"],"details":"Show and tell session in which you can learn how to create a course site in Sakai Open Academic Environment (OAE).\r\n\r\n- pathology course site at bachelor's level\r\n- available for all students in the Netherlands\r\n- OAE linked to other higher education institutions via national infrastructure "}, { "title":"Developing With Git and Github","date":"11-Jun-2012","time":"2:30 PM","room":"Peachtree Ballroom","track":"Design and Development","level":"All","type":"Development","presenters": ["Freeman, Stuart"],"details":"Git and Github are great tools, but there's a learning curve. I'll show a simple workflow and how git can help you when you make common mistakes. Then we'll move on to some more advanced usage and time-saving tips and wrap up with scripting our own git commands."}, { "title":"Documentation: Past Lessons and Future Directions","date":"11-Jun-2012","time":"2:30 PM","room":"Tower 1401","track":"Design and Development","level":"All","type":"Support","presenters": ["Lynch, Patrick ","Regan, Alan","Venstra, Elizabeth "],"details":"The Documentation Birds of a Feather session will bring together colleagues interested in documenting systems for our users. A small, but perfectly formed, group of folks from around the Sakai community have been collaborating together to document some of the changes in Sakai CLE v2.9.\r\nThe group has looked at five tools over a couple of months and will have complete reviews, extensions, rewrites of the help files integrated into the launch of 2.9 via Indiana University's help repository. The team will share their experiences, frustrations and achievements with attendees at the BOF.\r\nAttendees will find useful lessons for their own campus approaches to Sakai documentation, and it is quite possible that our experience may be useful for other systems, too.  We also hope to promote the effort to recruit more contributors to the project.\r\nThe group would also like to throw out a challenge to any developers who may be interested in helping to create a more useful help tool than the one we currently have. Let's discuss the features our users need in a help system so that we can devise a better solution to deliver first class help.\r\n"}, { "title":"Dynamics of a University Educational Technology Portfolio: Sakai at Charles Sturt University","date":"11-Jun-2012","time":"2:30 PM","room":"Tower 1404","track":"Leadership and Future Directions","level":"Intermediate","type":"Administrator/Executive","presenters": ["Uys, Philip"],"details":"Charles Sturt University (CSU) has developed an extensive and balanced educational technology portfolio over the last seven years in which Sakai CLE is a centre piece, as will be the case with Sakai OAE in future. At CSU we embed educational technology within an educational framework where university provided and external technologies operate in dynamic relationships with each other and with learning and teaching goals to shape blended learning environments. The relationship of Sakai CLE and OAE with other technologies and its key role in this rapidly changing and challenging higher education environment will be described in meeting the diverse needs of adult, school-leaving, distance, and on-campus and students. This presentation draws on the use of Sakai CLE at CSU since 2007 and our deep involvement with the OAE project over the last three years."}, { "title":"Duke\\'s eLearning Roadmap and the Sakai Transition","date":"11-Jun-2012","time":"2:30 PM","room":"Tower 1403","track":"Getting Started","level":"All","type":"Newcomer","presenters": ["Miller, Shawn","Caidin, Neal"],"details":"Duke's move from Blackboard to Sakai involves much more than simply planning and executing a mass migration: it serves as a key step in Duke's larger eLearning strategy which hopes to shift the focus away from the LMS as a one-point solution for all eLearning needs, and instead leverage the LMS as an integration point for a suite of available Duke and non-Duke tools. \r\nParticipants attending the session will be better able to assess and plan similar transitions or implementations. Through a review of Duke's experiences and lessons learned, participants will be able to adapt successful models to their own campus culture and manage priorities to better align their projects with broader institutional goals. "}, { "title":"Exploring Choices, Collaboration and Community with Sakai CLE as the Cornerstone","date":"11-Jun-2012","time":"2:30 PM","room":"Conference Center Room 5","track":"Expanded Solutions","level":"All","type":"Advocate","presenters": ["Ramsay, Martin","Siddall, Scott"],"details":"Sakai forms the foundation for exciting work being done in unusual spaces:  a consortium of small colleges in Appalachia (the LAMP consortium); a group of seminaries and missions organizations around the globe (the LikeBerea consortium); and a commercial leadership development effort (Leaders Ought To Know?).  This session focuses on the many choices offered by Sakai including options for hosting, support and funding as well as ways to extend Sakai through integrated Drupal front ends, BigBlueButton video conferencing, Turnitin plagiarism detection, iRubric, and Vimeo video streaming. The session will show how Sakai can be used as a foundation for true, award-winning collaboration (one consortium won the Mellon Award for Technology Collaboration) and the creation of community, even when that community spans the globe.\r\n\r\nTo explore the potential for Sakai to go far beyond its traditional uses or to hear inspirational stories that will fire your imagination come to this session."}, { "title":"TWSIA Award: ePortfolios in Virginia Tech\\'s First-Year Experiences Program","date":"11-Jun-2012","time":"2:30 PM","room":"Conference Center Room 2","track":"Teaching, Learning, Portfolios and Research","level":"Intermediate","type":"Instructional Design","presenters": ["Summers, Teggin","Zaldivar, Marc"],"details":"TWSIA Winner!\r\nThis session overviews the use of Sakai ePortfolio tools in a university-wide first-year experience program: Pathways to Success.  Adopted as an integral part of the university's accreditation, the Pathways program uses ePortfolios to balance large-scale institutional assessment with student-centered pedagogy that is rooted within the disciplines. Some programs embed reflective activities within Assignments and Link them to the Matrix; others display granular reflective prompts in the matrix; and others link Matrices and Templates, making learning visible to larger audiences. Programs are also able to create showcase portfolios, each with different audiences and purposes, such as advising and development of identity, and reflections on course projects, some that culminate in an ePortfolio Share Day, where students present their portfolios and discuss meaningful learning moments.  Presenters will share these experiences, including planning, deployment, and long-term development."}, { "title":"Introduction to 2-3-98","date":"11-Jun-2012","time":"2:30 PM","room":"Conference Center Room 3","track":"Awareness and Advocacy","level":"All","type":"Advocate","presenters": ["Masson, Patrick"],"details":"The 2-3-98 Project invites college and university administrators, faculty and researchers, IT and program managers, hands-on staff and students collaboration opportunities for the development and distribution of a wide variety of resource materials promoting greater awareness, assessment and adoption of open resources and initiatives.\r\nThe 2-3-98 project strives to collect and disseminate reference documentation on the design, development and deployment of open projects (OSS, OER, OCW, etc.) within higher education; identify, assess and communicate the various considerations, characteristics and qualities enabling or constraining the understanding, adoption and practice of openness; and provide a data for those who may be considering the feasibility and viability of open initiatives within their own organizations.\r\nThis session will explain the role of 2-3-98 and outline opportunities for Jasig and Sakai collaboration, contribution and community."}, { "title":"Online Evaluations at Berkeley","date":"11-Jun-2012","time":"2:30 PM","room":"Tower 1402","track":"Deployment and Integration","level":"All","type":"Administrator/Executive","presenters": ["Zeckoski, Aaron","Ogle, Daphne"],"details":"University of California, Berkeley is piloting the Sakai Evaluation System this year and working on improvements and updates to the tool (including UX improvements!). Come see what features and changes have been made and what the plans are going forward (like integration with OAE). We will also talk about the experiences so far at UCB and hope to hear from others who are piloting or using the tool in production."}, { "title":"uMobile Overview","date":"11-Jun-2012","time":"2:30 PM","room":"Conference Center Room 4","track":"Deployment and Integration","level":"All","type":"Mobile","presenters": ["Bourey, Jennifer"],"details":"uMobile introduces a higher-education focused platform for delivering authenticated, personalized content to mobile devices. Core features enable integration with campus directories, calendars, and learning management systems, as well as provide useful mobile tools such as maps.\r\nBacked by Jasig and a group of university sponsors, uMobile is built on top of well-tested integration libraries and benefits from a long history of community collaboration. The use of web-based technology allows universities to work in a familiar development environment, while open APIs and standards-based implementations enable integration with diverse university data sources. Role-based content distribution allows universities to target diverse communities such as students, staff, visitors, and alumni with relevant content.\r\nThis session will discuss uMobile adoption, demonstrate how uMobile can meet campus needs, and present the roadmap for future development.\r\n"}, { "title":"Sakai SIS Integration: Past, Present, and Future","date":"11-Jun-2012","time":"2:30 PM","room":"Conference Center Room 1","track":"Technical Management","level":"All","type":"Newcomer","presenters": ["Bush, John","Kamali, Simin"],"details":"This session will explore the historical nature of Student Information System (SIS) integration in Sakai. We will examine various methods of batch and real time integration and how they have evolved over time. The session will explore the different needs of individual institutions when it comes to synchronization of SIS data with the LMS, and how these common problems can be solved. On the menu in this session are things like terms, courses, sections, enrollments, gradebook export, and cross listing.\r\nFor the past year and a half rSmart and Sungard have engaged in a partnership to deliver IMS LIS integration between Sakai and Sungard Banner. The outcome of this work and our experiences in real world production environments will be discussed.  \r\nFinally, in this session we discuss how we are leveraging our experiences with Sakai2 and LIS in order to bring SIS integration forward into OAE."}, { "title":"An Update and Discussion of the Mobile Sakai Initiative","date":"11-Jun-2012","time":"3:45 PM","room":"Conference Center Room 3","track":"Leadership and Future Directions","level":"Intermediate","type":"Mobile","presenters": ["Johnson, Douglas"],"details":"The Sakai community recognizes the important of mobile access to Sakai services. As a result, in 2011 established the Mobile Sakai project to coordinate efforts toward mobile support in both the CLE and OAE.\r\nOver the last year, the Mobile Sakai project has made some progress defining key work areas including:\r\na. Data - What data? How to move data to and from mobile devices?\r\nb. Authentication & security - OAuth/Shibboleth; addressing security on mobile devices, two factor authentication?\r\nc. Services - Identifying necessary components to mobilize; prioritizing Sakai tools to work in the mobile environment; \r\nd. Interface - UI/UX \r\ne. OEA - Defining a-d above for OAE\r\nThis session will present an update on these areas; discuss directions for 2011-2012; and continue to solicit input, suggestions, needs and desires for the broader user community.\r\n"}, { "title":"Black Belt Support V: The Sakaiger Connection","date":"11-Jun-2012","time":"3:45 PM","room":"Tower 1403","track":"Technical Management","level":"All","type":"Support","presenters": ["Ziegler, Jeff"],"details":"This interactive session will review several beginner, intermediate, and technically advanced scenarios in Sakai customer support. Compiled from real-life user support cases gathered over the past year at the University of Michigan, progressively more difficult-to-resolve support requests will be introduced, then audience discussion of possible solutions, and ultimately present the actual solution. If you support Sakai end-users, you WILL learn something in this presentation. If you are a developer or designer, this is your chance to learn more about those mythical beings who actually use the tools and functions you create. User support is not just a job, it's an adventure. Go from Novice to Advanced support troubleshooter in one easy session, Grasshopper!"}, { "title":"Fordham Goes ABAC for CAS - Extending CAS with Attribute-Based Access Control","date":"11-Jun-2012","time":"3:45 PM","room":"Tower 1404","track":"Deployment and Integration","level":"All","type":"Identity Management","presenters": ["Muller, Kevin","Thompson, Bill "],"details":"Fordham University has begun a staged migration of its authentication infrastructure to CAS. The process began with a pilot to support one externally hosted application, and it quickly progressed to include many other strategic university applications. We had partnered with Unicon, along the way, to provide subject matter expertise, and to help us increase ours as well. More recently, we endeavored to extend the CAS to include attribute-based authorization control. This initiative will help to provide a foundation for future application architecture upgrades. In the spirit of extending CAS, we look forward to combining with Shibboleth, so that the university will be well positioned to securely share information with colleagues at other institutions. This session will provide an overview of our approach, the technical architecture, and lessons learned."}, { "title":"Enhanced Textbook Tool for Sakai CLE","date":"11-Jun-2012","time":"3:45 PM","room":"Conference Center Room 2","track":"Design and Development","level":"All","type":"Development","presenters": ["Aggarwal, Maneesha","Arzumanyan, Marina","Yoo, Jeong"],"details":"Since 2008, federal regulations in the United States have required textbook information to be made available by instructors to students at the time of registrations. These rules were adopted in response to the rising cost of textbooks and other course materials.\r\nColumbia University has enhanced the existing Sakai CLE Textbook tool developed at the University of Michigan with more features for students, instructors, and academic administrators, including: list entry using ISBN with search against external services, import from other courses, and upload from an Excel file; ability to mark entries as required or recommended and provide additional instructions from instructors; display of updated pricing information provided by commercial services; and, additional administrative tasks such as automated reminders, mass migrations, and compliance monitoring.\r\nOur presentation will provide an overview of the enhanced tool, its origins and requirements, and results from the current pilot."}, { "title":"I Wanna Help, But JIRA Scares Me & Getting My Own Tomcat Seems Dangerous","date":"11-Jun-2012","time":"3:45 PM","room":"Conference Center Room 5","track":"Getting Started","level":"Beginner","type":"Newcomer","presenters": ["Clare, Matt"],"details":"The Sakai community is much larger than those able to contribute code to the projects. Contributions can be in the form of an idea, an observation, or a bug, and can come from those that are just curious or those eager to help. This session will involve words of wisdom from those with experience. It will include:\r\n* An introduction to JIRA (the feature request and bug ticketing system)\r\n* Community mailing lists (how to keep informed and ask questions)\r\n* Quality assurance (be part of product testing)\r\nMost importantly, this session will include a conversation about how valuable anyone?s observations, evidence and ideas can be to the open source development process."}, { "title":"Learning Analytics 101","date":"11-Jun-2012","time":"3:45 PM","room":"Peachtree Ballroom","track":"Expanded Solutions","level":"All","type":"Newcomer","presenters": ["Lonn, Steve","Baron, Josh"],"details":"Learning Analytics is an emerging topic of interest throughout all levels of education focusing on how to harness the power of data mining, interpretation, and modeling. \r\nHowever, there are several similar terms (academic analytics, predictive analytics, business intelligence, etc.) that can confuse educators and administrators alike. In this session, we will unpack this new area of interest and discuss how institutions can begin to leverage available products and open source communities to utilize analytics to improve understandings of teaching and learning and to tailor education more effectively.\r\n\r\nOur panel will briefly present an overview of the learning analytics field, drawing from popular examples such as the Signals project at Purdue U. and the Check My Activity tool at U. Maryland, Baltimore County. We will also review the structure of Sakai CLE and OAE user-level metrics and briefly discuss projects to design and implement tools to utilize these metrics in meaningful ways."}, { "title":"Enhancing Online Collaboration in Distance Courses","date":"11-Jun-2012","time":"3:45 PM","room":"Conference Center Room 1","track":"Teaching, Learning, Portfolios and Research","level":"Beginner","type":"Instructional Design","presenters": ["Jensen, Ann","Strand, Liz"],"details":"Based on end-of-course surveys, we find that students often express frustration with online teamwork assignments. On the other hand, many students report that they enjoy team work and benefit from it.\r\nGiven the value of effective collaboration and based on best practices, we designed a number of supports to improve the quality of the team experience. Teamwork supports, which will be shared with session participants, include a pre-program, online module on collaboration benefits, a teamwork tips website describing collaborative technologies, socialization in the form of an online discussion forum of past teamwork experiences, a team charter assignment, and peer evaluation rubrics.  \r\nWe implemented the supports in online social work courses and administered an Attitude toward Teamwork pre-/post-survey to determine if the supports made a difference. We will share the preliminary results with session participants. \r\n"}, { "title":"Tests and Quizzes (Samigo)","date":"11-Jun-2012","time":"3:45 PM","room":"Tower 1401","track":"Design and Development","level":"All","type":"Development","presenters": ["Li, Lydia"],"details":"This is an informal discussion session open to all who are interested in Tests and Quizzes (Samigo). Ux, developers and admin/support are all welcome.  "}, { "title":"Zero to Sakaiger: A Getting-Started Guide for Developers & Implementors","date":"11-Jun-2012","time":"3:45 PM","room":"Tower 1402","track":"Getting Started","level":"All","type":"Development","presenters": ["Monat-Jacobs, Nicola"],"details":"Stuck getting started with Sakai? Not sure where to look for help, tools, patches & recommendations? Learn the approaches that experienced developers and implementors use for building, configuring and deploying Sakai, managing customizations, registering bugs, finding patches and making recommendations to the community. Learn how to be a JIRA ninja and all about \"indie\" tools. Hidden tips and tricks to help you get the most of what's out there. Learn the things that experienced Sakaigers \"just know\" all in one session!"}, { "title":"uPortal 4 In Action: SCSU","date":"11-Jun-2012","time":"3:45 PM","room":"Conference Center Room 4","track":"Deployment and Integration","level":"Beginner","type":"Development","presenters": ["Makarov, Konstantin","Wills, Drew"],"details":"Saint Cloud State University (SCSU) selected uPortal for their campus portal in 2011, and quickly decided to base their new Huskynet portal on the latest framework version: uPortal 4. SCSU faced some uncommon challenges with uPortal, since their existing campus computing infrastrucure is based on Microsoft products and .NET technologies. Nevertheless SCSU has been very successful with uPortal 4 and very happy with their decision. The feedback from the community has been very positive.\r\nIn this session we will showcase the SCSU Huskynet portal and cover the path they took in adopting and implementing uPortal 4. We will look at what worked well, what worked less well, and the advice SCSU can offer other schools for implementing a portal strategy. We will also discuss the use of Jasig portlets and how they provide \"low hanging fruit\" for rolling out a compelling portal on a tight schedule and budget."}, { "title":"Deploying Campus Wide Course Evaluations Using the Sakai CLE Evaluation System Hierarchy Provider","date":"12-Jun-2012","time":"10:45 AM","room":"Conference Center Room 5","track":"Expanded Solutions","level":"Intermediate","type":"Development","presenters": ["Ramsay, Martin","Monat-Jacobs, Nicola"],"details":"The Sakai CLE Evaluation System is great for course evaluations and institutional surveys. However, deploying those evaluations to Sakai courses can be tedious and complicated. Our presentation talks about the need for a hierarchy-based approach for deploying evaluations, and the steps you need to take to get there using the Evaluation System's Hierarchy Provider.  We will demonstrate a working Hierarchy Provider that is supporting a multi-institutional instance of Sakai in the LAMP Consortium, a group of thirteen small colleges, and will discuss both the technical and process aspects of deployment."}, { "title":"Deploying OAE Clusters","date":"12-Jun-2012","time":"10:45 AM","room":"Tower 1402","track":"Deployment and Integration","level":"Advanced","type":"Development","presenters": ["Froese, Erik","Campos, Kyle"],"details":"By the end of this talk you'll understand how to create a scalable cluster of Sakai OAE servers. We'll talk about clustering the OAE application, implementing high-availability, fault-tolerance, running OAE in the cloud, and the tools you'll need to get the job done.\r\nThis talk will feature Puppet. Puppet is a system configuration language that enables you to express and organize your system and application configuration. We'll demonstrate how to build a cluster of OAE machines that mimic a typical production deployment. We'll also talk about running OAE in the cloud, specifically on Amazon EC2."}, { "title":"eCommons","date":"12-Jun-2012","time":"10:45 AM","room":"Conference Center Room 4","track":"Leadership and Future Directions","level":"Beginner","type":"Advocate","presenters": ["Sherratt, Robert","Lynch, Patrick"],"details":"In mapping out the future direction at the University of Hull, a new project has been created, currently called eCommons. This represents a new approach for the institution when thinking about the overall online student experience. The project started in November 2011 and has a working definition of eCommons as: the online environment to facilitate effective teaching, learning and communications. From early consultation desired characteristics of eCommons include: integrated, seamless, personalised and intelligent. eCommons is not a new LMS for Hull, nor is it any other similar system. eCommons is a state of mind, the willingness to think holistically about how things can be joined up and the implications of that for students, faculty and support staff."}, { "title":"ESUP-Portail: A Global Approach of Digital Services for Higher Education in France","date":"12-Jun-2012","time":"10:45 AM","room":"Peachtree Ballroom","track":"Deployment and Integration","level":"Intermediate","type":"Administrator/Executive","presenters": ["Mayeur, Alain","Guerin, Mathilde"],"details":"ESUP-Portail is a French Consortium of education and research institutions to promote and develop open-source solutions for higher education in the field of portal of digital services for students and staff.\r\nThe main goals are to:\r\n- facilitate learning and campus life for students... but also the daily work of the staff\r\n- pool service development between universities to share costs\r\n- share technological developments and new services amongst the members\r\n- plan and design future advances of digital workspaces (portal of services)\r\nESUP-Portail is a national organization of more than 70 institutions of higher education.\r\nThe solutions it supports are selected in the field of open-source that allows a continuous evolution of services and tools. Since 2003, ESUP-portail has developed exchanges with the Jasig community and used both uPortal and CAS solutions.\r\nIt is noteworthy that the Consortium has a close working relationship with the French Ministry of Higher Education, which is an extremely valuable help to actually implement the ESUP's global strategy.\r\nTo keep the whole community up-to-date and informed of its strategy and work, the Consortium organizes two conferences a year (so far, it has held 13 conferences with more than 100 participants each time).\r\nUser experience feedback is always an important point of these ESUP-Days. These seminars also offer the opportunity to communicate about the strategy of Jasig and Sakai and, more recently, the objectives and challenges of the Jasig-Sakai merged structure.\r\nESUP-Portail is also organized in working groups (thematic \"workshops\"...) such as ESUP-ECM, ESUP-Grouper, ESUP-HCI, ESUP-Mobile,...\r\nA global approach: The community facilitates the exchanges (both within our community and beyond) and helps to the definition of the digital priorities, such as the choice of components and their interface with information systems.\r\nOne of our priorities is to explore open-source solutions and their potential integration in portal (ECM, e-learning, digital desktop, repository, collaborative platform, CMS....).\r\nSakai OAE may be added to the digital environment to offer new and innovative services for education and research community. It opens up new fields of developments, based on recent technologies and collaborative concepts applied in education.\r\nExamples of projects:\r\n- esup-commons v.2: Esup-commons is a development framework that allows developers to build applications that can be deployed either as portlets or servlets -sharing exactly the same code- and offers many other interesting features. All new development projects of the consortium are encouraged to use this framework, and several trainings are organized all over the country to encourage widespread use of these new technologies.\r\n- Packaging of ESUP v.4 : One of the main missions of the Consortium is to deliver a French package of the uPortal releases: the uPortal 4 is no exception. This work is necessary to include specific needs and requests of the French institutions, in a consistent approach which involves not only uPortal but also various projects such as Grouper, uMobile, etc. Other activities revolve around internationalization, look-and-feel customization, services adaptation, etc.\r\n- Showcases of the integration of e-learning platforms (Moodle, Sakai CLE, Dokeos...) into the ESUP-Portail environment.\r\n- Introducing ECM functionalities in the portal and creation of connectors with other applications\r\nMobility is one of the main priorities for the development of IT use on campus. In the last few years, the use of mobile devices (smartphones, tablets, etc.) has become more and more widespread, especially among youth such as our students. Having come to this realization, the Consortium decided to create the ESUP-Mobile Working Group. Its goal is to promote collaboration and pooling of resources to help institutions provide mobiles services to their users. In addition to developing mobile-friendly services to integrate into portals, ESUP- Mobile is now also looking into the uMobile solution provided by Jasig. Some of its members have come up with a few services (geolocation, augmented reality, etc.) they are willing to share with the Jasig community. In the wake of 2012, both ESUP-Portail and Jasig communities came to the conclusion that it would be a great idea to increase communication and collaboration with each other on this matter: this resulted in the participation of some ESUP-Mobile members in the uMobile Working Group and Community calls.\r\nThese exchanges contributed to what is hopefully going to be a long, fruitful and more global collaboration between the Jasig, Sakai and ESUP communities."}, { "title":"From Frightful Quagmire to Our QEP: How One University is Transitioning Its Entire Culture to Sakai","date":"12-Jun-2012","time":"10:45 AM","room":"Tower 1404","track":"Getting Started","level":"All","type":"Support","presenters": ["Gray, Robert","Davidson, Jeff"],"details":"In this session, we will share the migration experience of the University of South Alabama, including how \r\n*\tUSA performed a year-long review of available LMSs, and why we ultimately chose Sakai\r\n*\tthe University unified most of its support operations by combining them into the Innovation in Learning Center\r\n*\twe planned for the migration process, including the development of an incentive program to motivate faculty to move their content to Sakai\r\n*\twe managed the integration of several third-party systems, including the Student Information System\r\n*\twe developed an integrated support system that combines local resources and a third-party helpdesk service\r\n*\twe designed and developed our comprehensive training and certification program\r\n*\tthe University's new Quality Enhancement Plan, which is part of our reaccreditation process, was designed around the collaborative teaching and learning possibilities offered by Sakai."}, { "title":"Getting Ready For InCommon Assurance","date":"12-Jun-2012","time":"10:45 AM","room":"Tower 1406","track":"Leadership and Future Directions","level":"All","type":"Identity Management","presenters": ["Oshrin, Benjamin"],"details":"InCommon Assurance profiles (Bronze and Silver) define standards for credentials in a federated environment, allowing service providers to have faith that the users from your campus have been properly vetted and are, in fact, the ones authenticating to their services. Campuses are starting to prepare for compliance with these profiles, as various services (especially at the federal level) are likely to require them in the coming years.\r\nDiscuss the current state of the bleeding edge with fellow early adopters, or learn the basics if you're just getting started. This BoF will be light on presentation and heavy on conversation."}, { "title":"Improving Instruction with Open Educational Resources","date":"12-Jun-2012","time":"10:45 AM","room":"Conference Center Room 2","track":"Teaching, Learning, Portfolios and Research","level":"All","type":"Faculty","presenters": ["Neugebauer, Ronda","Thanos, Kim"],"details":"In 1998 David Wiley coined the term \"Open Content.\" Three years later MIT launched its Open CourseWare initiative. Since that time institutions around the world have published course materials with an intent that other will re-use, revise, remix and redistribute the open educational resources (OER). Still, today most educators incorporate little if any OER in their courses. \r\nThis session will explain why to use OER, including results of a research study capturing the experiences of students and faculty. It will also provide practical steps to redesign one module of your course with OER. Finally, we will share our current use of Sakai OAE as the perfect platform to finally realize the benefits of OER that have evaded us."}, { "title":"Sakai OAE as a Scholarly Communications Tool","date":"12-Jun-2012","time":"10:45 AM","room":"Conference Center Room 1","track":"Teaching, Learning, Portfolios and Research","level":"All","type":"Administrator/Executive","presenters": ["Lewis, Armanda","Appert, Lucy"],"details":"The Sakai OAE has much potential as a course management tool, though there is less exploration of using the platform as a viable scholarly communications tool. As a large global university, we aim to build and nurture relationships between scholars, to promote their work within the university and beyond, and to foster links between scholarship and teaching.  \r\nWe will discuss the pilot use of the Sakai OAE as a platform for scholarly collaborations and research among a small group of faculty members and graduate students. In addition to speaking about the successes and challenges of using the tool to disseminate scholarship, facilitate peer review, and promote and sustain fruitful exchanges among scholars, we will propose design considerations. Additionally, we will offer broader considerations for creating a continuum between the teaching, learning, and research portions of academia."}, { "title":"Student Success Plan - Engage, Plan, Support, Complete - Retention, Success, and Graduation Rates","date":"12-Jun-2012","time":"10:45 AM","room":"Conference Center Room 3","track":"Leadership and Future Directions","level":"All","type":"Administrator/Executive","presenters": ["Little, Russ"],"details":"The Student Success Plan (SSP) supports and enables processes and interventions designed to increase the persistence, success, and graduation rates of targeted students. Through holistic counseling, web-based support systems, and intervention techniques, students who are at risk of failing in college are identified, supported and monitored. Data is collected and analyzed to make decisions about future efforts. SSP includes case management tools, a journal of contact with students, early alerts, and an individual action plan. A student interface is available to connect with coaches, search resources, use self-help guides and create/review action plans. SSP has a proven and documented track record of success in improving student outcomes. It has been honored with 11 national awards and has been adopted by five other colleges. Learn how SSP has impacted our student success, retention and completion rates, how we measure that, and what we have planned for the future of SSP as OSS."}, { "title":"The Future of Assignments","date":"12-Jun-2012","time":"10:45 AM","room":"Tower 1401","track":"Design and Development","level":"Beginner","type":"Instructional Design","presenters": ["Monat, Nicola"],"details":"What is the future of assignments in Sakai CLE? Where do we want to take assignments, and what's the bridge to OAE? What new features are folks looking for in the Assignments tool? This is intended to be a community discussion and planning session with the intent that the result will be a mailing list/working group that will provide a forum for these types of discussions over the long term."}, { "title":"Using Sakai Site Archive for Good not Evil","date":"12-Jun-2012","time":"10:45 AM","room":"Tower 1403","track":"Design and Development","level":"Intermediate","type":"Development","presenters": ["Holdorph, Cris"],"details":"The Sakai Site Archive feature has never been intended to be a general purpose import/export facility. However, when a recent project required this exact kind of behavior, the Sakai Site Archive facility was used as a starting point.\r\nThis session will look at the the benefits of starting with Sakai's Site Archive system in order to create a general purpose import / export facility.  We will look at how the system works with Sakai's modular tools and what problems/pitfalls come along with using it."}, { "title":"The Sakai Open Academic Roadmap: Product and Process","date":"12-Jun-2012","time":"1:15 PM","room":"Peachtree Ballroom","track":"Leadership and Future Directions","level":"All","type":"Instructional Design","presenters": ["Appert, Lucy ","Goodrum, David ","Matthijs, Nicolaas","Whyte, Anthony "],"details":"The Sakai Open Academic Environment (OAE), the Sakai Foundation's next-generation open source product for teaching, learning, and research, has undertaken a deeply collaborative project organization that distributes development planning input among users, designers, and developers. The OAE Project structure and product represent a holistic effort to develop a coherent platform for teaching, learning, and academic networking and to use for that development a design-led process that foregrounds user needs and the user experience.\r\nThis presentation will provide an update on the OAE Project's development planning process and product, including the project roadmap for the next 24 months and highlights from recent releases. "}, { "title":"Benten as A Community Translation Platform in Sakai and Jasig Communities","date":"12-Jun-2012","time":"1:15 PM","room":"Conference Center Room 1","track":"Design and Development","level":"Intermediate","type":"Development","presenters": ["Kajita, Shoji"],"details":"This presentation introduces Benten, an open source based collaborative translation workflow support system, and describes (1) best practices for localization of Sakai CLE and uPortal and (2) adaptation to local needs at Kyoto University. Through the last decade, open source based solutions such as uPortal and Sakai CLE had been enabling higher educational institutions to collaborate in the level of source codes. The collaborative development support systems such as Jira and Subversion lowered institutional barriers to realizing the notion of Community Source. However, we still have challenges in translation for messages, buttons and help files for Sakai and Jasig products beyond institutional barriers. Also, each institution has their own needs to translate these translational units to adapt common translation to institutional culture. In this presentation, we will introduce Benten as a collaborative translation support platform in Sakai and Jasig Communities. "}, { "title":"A Sakai-Friendly Enterprise Wide Strategy for Digital Media Delivery","date":"12-Jun-2012","time":"1:15 PM","room":"Tower 1406","track":"Expanded Solutions","level":"Intermediate","type":"Media/Multimedia","presenters": ["Norton, Mark","Webster, Matt"],"details":"MediaCAST is a digital content management and streaming platform, specifically designed to meet the needs of 21st century educational institutions.  MediaCAST opens up a new set of engaging teaching possibilities by integrating an unlimited amount of publisher content, user-generated content and live streams into Sakai courses. Students and teachers can upload, search and segment resources stored in the MediaCAST centralized library, right from their Sakai course page.\r\nIn this presentation, Matt Webster and Mark Norton will demonstrate how to integrate MediaCAST into Sakai and how the tools can be used to push digital video and other media resources to mobile devices such as iPads, so that students have the right material for the right course at the right time on the right device.  They will explore some of the pedagogical uses for these tools to improve the quality of courses delivered in SAkai and other LMS environments."}, { "title":"Common Pitfalls of the Sakai Gradebook and How to Avoid Them","date":"12-Jun-2012","time":"1:15 PM","room":"Tower 1404","track":"Getting Started","level":"All","type":"Faculty","presenters": ["Lyons, David"],"details":"This session will cover common, but often overlooked and undiagnosed, problems with setup and use of the Sakai gradebook. Something as trivial as an unchecked box, a misplaced decimal point, or a wrongly categorized item can drastically alter your entire courses final grades. By the end of this session you should be familiar with the kinds of mistakes and gotchas that can happen in any kind of course that utilizes the Sakai gradebook, and know how to correct them."}, { "title":"Evaluation System","date":"12-Jun-2012","time":"1:15 PM","room":"Tower 1401","track":"Expanded Solutions","level":"All","type":"Development","presenters": ["Monat-Jacobs, Nicola"],"details":"A working session for those in the Evaluation System working group."}, { "title":"Integrating Grouper and OAE","date":"12-Jun-2012","time":"1:15 PM","room":"Tower 1402","track":"Deployment and Integration","level":"Intermediate","type":"Development","presenters": ["Froese, Erik"],"details":"Grouper is a powerful open-source group middleware from the Internet2 consortium. It provides a central point of management for group information and membership as well as a few different methods of integrating with other systems.\r\nIn this talk we'll focus on four areas: strategies for structuring and managing course enrollment data in Grouper, how to expose that data to Sakai OAE and other systems, how to manage the relationship between institutional and ad-hoc data and keep systems in sync, and how our strategy may be applied to other integration projects. We'll also give an update on our progress at NYU since the last conference. "}, { "title":"Launching Sakai Successfully with a Hosting Partner","date":"12-Jun-2012","time":"1:15 PM","room":"Tower 1403","track":"Technical Management","level":"Beginner","type":"Administrator/Executive","presenters": ["Flynn, Gerard","Ottenhoff , Sam","Regan, Alan ","Siddall , Scott"],"details":"Are you considering adopting Sakai? Are you investigating whether or not to host and support it yourself? If so, then you would benefit from attending this session in which representatives from Pepperdine University, an institution that has been using Sakai for three years, and the Longsight Group, a Sakai commercial affiliate that provides hosting services and concomitant support, will share the secret to a successful implementation of Sakai and why you may wish to seek hosting partner.\r\nIn 2009, Pepperdine personnel had no experience with Sakai nor resources to host it, yet desired to pilot the product. The Longsight Group submitted the winning RFP and was commissioned to host and support the service. The pilot was tremendously successful, the transition from pilot to production was seamless, and the relationship between Pepperdine and Longsight has grown into a partnership that results in positive faculty and student experiences with Sakai.\r\nRepresentatives from each side of the relationship will share their advice to other institutions considering hosting Sakai -- what works, what doesn't, and how to create a true partnership."}, { "title":"The Many Faces (or Facets) of Bedework","date":"12-Jun-2012","time":"1:15 PM","room":"Conference Center Room 4","track":"Deployment and Integration","level":"All","type":"Development","presenters": ["Schwartz, Gary","Leibson, Barry"],"details":"The Bedework Enterprise Calendaring System was conceived in 2005, with the first production release, Bedework 3.0, in March 2006. Bedework has been a Jasig sponsored project since March 2010.\r\nBedework was originally envisioned as \"a calendar system for higher education\", albeit not exclusively so, with components for public events calendaring and personal calendaring. Bedework has been deployed as a 'standalone' calendaring system, but it has also been integrated into other software systems, both open source and proprietary.\r\nIncreasingly we are looking to exploit Bedework beyond its capabilities as a standalone calendaring system, looking towards what we refer to as '\r\n'calendaring as a platform', or more grandiosely as \"W2C - The World Wide Calendar.\" Bedework 3.8, our most recent release of January 2012, adds significant capabilities with respect to the \"The World Wide Calendar\" vision.\r\nWe will present scenario-based examples of deploying Bedework beyond its traditional roles, hopefully inspiring new, even wider-ranging scenarios including\r\nCampus-wide communications\r\nSmartphone applications\r\n\"fronting\" Bedework with PhP or Ruby\r\nCalendar aggregating\r\nUsing Bedework components outside of  the Bedework system proper\r\nUsing  Bedework Web Services \r\nThis session is not a \"how-to-do-it\" session for developers, but a \"what can be done\" and \"what has been done\" session for IT support staff and management, and end users alike."}, { "title":"The Present and Future of the Jasig Incubation Process","date":"12-Jun-2012","time":"1:15 PM","room":"Conference Center Room 3","track":"Leadership and Future Directions","level":"All","type":"Development","presenters": ["Carroll, Tim","Gertz, Patty "],"details":"How does an effort become a sponsored project of the organization? This presentation will describe the current process of sheparding both software and communities of interest projects to a goal of long term sustainability and support. \r\nWe will look at success stories, the most recent entries, and how even when the project doesn't graduate from incubation we consider the process a success.\r\nWe will discuss what incubation might look like in a merged organization. "}, { "title":"What to Say When You Hear \"I\\'ll NEVER Teach Online!\"","date":"12-Jun-2012","time":"1:15 PM","room":"Conference Center Room 2","track":"Teaching, Learning, Portfolios and Research","level":"All","type":"Instructional Design","presenters": ["Jones-Pokorney, JoLaine"],"details":"You probably encounter faculty who have a bad opinion of teaching online. Perhaps they're intimidated by technology or they imagine an online course to be nothing but video lecture and multiple choice tests taken by faceless students (probably cheating the whole time)!  They may have anxiety about becoming obsolete - nothing more than a talking head in a video lecture.\r\nLearn how to introduce exciting new possibilities to enhance their face-to-face course with an online presence. Faculty who value face-to-face time with students will love to hear how they can get their students to complete assigned readings before coming to class, AND find out exactly what they should focus on in their class time, by posting their readings online and giving a short assessment prior to class. This is just one of the many ways to help faculty move from a lecture-focus to the creation of a learning community where students and faculty are a team, exploring the content in exciting new ways.\r\n\r\n"}, { "title":"Columbia Goes Goo-Google for CAS - Extending CAS with WIND Protocol Support and Service Registry","date":"12-Jun-2012","time":"2:30 PM","room":"Conference Center Room 4","track":"Deployment and Integration","level":"All","type":"Identity Management","presenters": ["Ellentuck, Dan","Thompson, Bill"],"details":"When Columbia University decided to move to Google Apps, CAS was a natural choice, but like many campuses, Columbia already had a highly customized home-grown web authentication system. What was needed was a way to bridge the two systems to provide the 200+ application clients an orderly migration from the legacy system to CAS. This solutions talk will first review CAS support for Google Apps. Then it will describe Columbia's legacy-to-CAS migration strategy, which uses the CAS support for multi-protocol extensions to talk to current WIND clients in the legacy API, while at the same time talking SAML to Google Apps.  It will also describe how the more extensive service model of the legacy system is made available to CAS. Lots of code you can use."}, { "title":"From Beginning to End to Beginning: Development, Implementation, and Assessment of ePortfolios","date":"12-Jun-2012","time":"2:30 PM","room":"Conference Center Room 2","track":"Teaching, Learning, Portfolios and Research","level":"Beginner","type":"Instructional Design","presenters": ["Zaldivar, Marc","Sparrow, Jennifer","Summers, Teggin"],"details":"This session will overview the ePortfolio experience, from conceptualizing and creating the content of an ePortfolio, to assessing the content using rubrics, to planning for programmatic or institutional ePortfolio programs. The first section focuses on developing student activities for useful content in a portfolio. Participants will get the opportunity to explore new online instructional technologies and discuss the creation of student-centered ePortfolio activities. The second section focuses on the development and incorporation of reflective practice in a variety of disciplinary and technological settings. The third section \"completes the cycle\" and demonstrates how good assessment practice can provide useful feedback to both the student and the institution. Through both practical application and discussion, the workshop leaders hope this session will provide experience at every level of the ePortfolio process."}, { "title":"Integrations and Customizations in Sakai OAE","date":"12-Jun-2012","time":"2:30 PM","room":"Conference Center Room 5","track":"Expanded Solutions","level":"All","type":"Media/Multimedia","presenters": ["Pasch, Jeff","Dorairaj, Madan"],"details":"New York University's implementation of Sakai OAE is called \"The ATLAS Network\". Our vision is to position ATLAS as the collaboration tool that will provide seamless integration to various academic systems. Currently, NYU uses Kaltura for storing and viewing rich multimedia content. Additionally, NYU's Digital Library Technology Services has developed a drupal-based eBook Reader Platform. ATLAS will provide seamless and secure access to these repositories and will treat the artifacts therein as pieces of content within Sakai, enabling users to manage this content just as they would manage any other piece of content within Sakai. This presentation will provide insight into the integration approach that NYU has taken to integrate Kaltura and eBook reader platform. Furthermore, we will highlight additional customizations that NYU has implemented, including tag clouds, to support teaching and learning and collaboration."}, { "title":"Project X: How Sakai Project Sites Improve Communication and Collaboration on Campus                ","date":"12-Jun-2012","time":"2:30 PM","room":"Tower 1401","track":"Expanded Solutions","level":"All","type":"Instructional Design","presenters": ["Royas, Benjamin"],"details":"One the early decisions made by the Claremont Colleges in 2006 allowed all registered users to create their own project sites in Sakai. Since then, Claremont McKenna College has seen an increased popularity in Sakai project sites among staff, faculty and student groups. Instructional technologists have worked to spread awareness and tailor project sites to meet individual groups? needs, with overwhelmingly positive outcomes. We will discuss how our institution and others utilize project sites for faculty, staff, and students; assess whether or not project sites are a useful method of sharing information and improving communications among committees and similar groups; plan ahead for events which could benefit from the use of a project site; and take a look at some best practices for utilizing and maintaining project sites on campus."}, { "title":"Rich Media in the Academic Platform","date":"12-Jun-2012","time":"2:30 PM","room":"Conference Center Room 1","track":"Leadership and Future Directions","level":"All","type":"Media/Multimedia","presenters": ["Hancock, Mara"],"details":"Rich media is an increasingly important part of the academic content and course design. It is a key element to many of the initiatives that promise to transform the educational experience. Various use cases and trends that highlight the interest and potential in this domain are: integrating video content into the flow of the course and the course materials, video mini-lectures in online courses, multimedia commentary and creation by the students, offering lecture capture and flipping the classroom, and more.  \r\nEducational Technology leaders are finding it necessary to think holistically about a new approach to integrating rich content that includes not only workflow and automation, but also the integration with our classrooms and classroom teaching and our learning systems.\r\nThis session will explore these issues, some of the potential solutions and projects underway. It will highlight some of the work coming out of the Opencast Project that reflects this new understanding and direction.\r\nThe Opencast Project is a community of practice and co-creators of the open source rich media platform, Opencast Matterhorn, that looks at these issues and is offering solutions in both product and practice.  "}, { "title":"Rutgers Lessons Tool","date":"12-Jun-2012","time":"2:30 PM","room":"Peachtree Ballroom","track":"Design and Development","level":"Intermediate","type":"Development","presenters": ["Hedrick, Charles"],"details":"This presentation will include a brief review of the Lessons Tool, which is part of 2.9, and is also available for earlier versions. This is a new tool intended to help instructors prepare online content. It allows content pages to be build from:\r\n* Inline text and other material prepared with an HTML editor\r\n* References to assessments, assignments, and forum topics\r\n* Inline multimedia\r\n* Student content pages, and student comments on items, both of which can be graded\r\nIt supports hierarchical and sequential structures, with the ability to require finishing or passing a test, assignment, etc in order to continue.\r\nThe presentation will include current status and plans."}, { "title":"uPortal Integration Strategies in Action","date":"12-Jun-2012","time":"2:30 PM","room":"Conference Center Room 3","track":"Design and Development","level":"All","type":"Development","presenters": ["Helwig, Jim"],"details":"My UW-Madison, the uPortal-based enterprise portal at the University of Wisconsin-Madison, has used a variety of techniques to successfully integrate content from a variety of enterprise applications. Techniques include deep linking, proxying, dashboards and content aggregation. Source systems include learning management systems (Desire2Learn), human resource (PeopleSoft), student information (PeopleSoft), email and calendar (Sun/Oracle), help desk (Infra) and others. This presentation will showcase examples, describe the techniques and highlight what has been contributed back to the community."}, { "title":"Look Before You Leap: Valuable Lessons from Azusa Pacific University\\'s Transition to Sakai","date":"12-Jun-2012","time":"2:30 PM","room":"Tower 1403","track":"Getting Started","level":"All","type":"Newcomer","presenters": ["Elliott, Daniel","Simmerok, Bruce","Wilson, Thomas"],"details":"It sounded easy enough... migrate 8000 courses from eCollege to Sakai; train 1400 instructors, integrate Sakai into the existing SIS, and create a new Sakai customer support system while continuing to develop new courses. After one year in Sakai, our eLearning team has a long list of things we wish someone would have told us before we started. In this session, we share our lessons learned.\r\nIf you are considering Sakai or are new, this workshop is for you. We were in your shoes last year, and we're here to answer the questions you don't know to ask.\r\n*   Learn what you must do BEFORE an orientation with your hosting service.\r\n*   Discover top faculty challenges and how we overcame them.\r\n*   Learn how to prepare for course migration into Sakai.\r\n*   Discover course design tricks for development in Sakai.\r\n*   Sample Sakai TV and other training tools that you can adapt for your faculty.\r\nYou will take home a valuable collection of practical strategies that you can implement immediately."}, { "title":"Changes in Sakai\\'s Citations Helper","date":"12-Jun-2012","time":"2:30 PM","room":"Tower 1402","track":"Design and Development","level":"Beginner","type":"Library","presenters": ["Notess, Mark","Cliff, David","Eng, Jim "],"details":"New ways to integrate library resources are being added to the Sakai CLE Citations Helper. We'll take a quick tour of the current capabilities of the Citations Helper, highlight some current work and describe future plans.  We'll review a set of proposals to streamline the user interface. We'll go through plans for multi-institution testing of RIS import/export, which has been a source of issues. We'll look at the move away from federated search support and plans for a generic facility for integration of new discovery systems such as EBSCO Discovery Service or Ex Libris Primo into the Citations Helper.  And we'll lead a discussion of future directions for integrating library resources into Sakai, both CLE and OAE. "}, { "title":"TWSIA Award: English Composition I","date":"12-Jun-2012","time":"3:45 PM","room":"Peachtree Ballroom","track":"Teaching, Learning, Portfolios and Research","level":"All","type":"Faculty","presenters": ["O'Hare, Daryl"],"details":"TWSIA Winner!\r\nComposition I promotes active learning and community building with multiple engagement opportunities. The most important feature of the course in this respect is the course writing community, which facilitates student-student engagement and instructor-student engagement at every turn. The course design uses only Open Education Resources (OER).  The innovations include: Cross referenced learning outcomes and topics so that expectations are explicit; weekly visual learning arc depiction to reinforce how the student can be successful that week; interactive grammar reports; a virtual presence badge to indicate Skype availability for student conferences with the instructor; guided, interactive pre-writing/note-taking exercises; and interactive writing with both teacher and peer reviews of work. All materials are ADA compliant. The presenter will discuss student success results with the new course design and provide a demo of key course components."}, { "title":"Evolving the Sakai + BigBlueButton Integration","date":"12-Jun-2012","time":"3:45 PM","room":"Conference Center Room 5","track":"Expanded Solutions","level":"All","type":"Media/Multimedia","presenters": ["Siddall, Scott","Dixon, Fred"],"details":"Come see the latest in live web conferencing, synchronous communications, session recording and playback!   \r\nIn this session, we'll take a deep dive into BigBlueButton release 0.8.   We'll focus on how to create, record and playback online meetings with the new integration into Sakai and how this feature can be used as a basic lecture capture tool. Along the way, we'll demonstrate BigBlueButton's features for presentations, whiteboarding, integrated audio, web cams and desktop sharing.  \r\nWe'll take a look at what's new in 0.8 including audio improvements, playback in HTML5, and the integration with Matterhorn. And we'll listen to your needs -- especially from those universities and colleges currently using BigBlueButton + Sakai -- so come help shape the BigBlueButton roadmap!\r\n"}, { "title":"Accessibility Status of Sakai CLE and OAE","date":"12-Jun-2012","time":"3:45 PM","room":"Tower 1404","track":"Design and Development","level":"Intermediate","type":"Development","presenters": ["Humbert, Joe","Richwine, Brian"],"details":"Interested in learning about the current status of Sakai's accessibility for both Collaboration and Learning Environment (CLE) and Open Academic Environment (OAE)? Come learn about the Sakai Accessibility Working Group and how it works to both evaluate and improve Sakai's accessibility.\r\nThis talk will include a description of Sakai's Accessibility Goals and how accessibility is included in the Sakai development and QA processes. We will also be sharing the latest results for the Sakai 2.9 and OAE v1.1 accessibility reviews including a possible roadmap for Sakai Accessibility. Discuss the top accessibility issues. Learn how you or others at your institution can get involved in the Accessibility Working Group to help improve access to Sakai for all users."}, { "title":"High Availability in Hurricane Alley - Multi-site Multi-node CAS Deep in the Heart of Texas","date":"12-Jun-2012","time":"3:45 PM","room":"Conference Center Room 4","track":"Deployment and Integration","level":"All","type":"Identity Management","presenters": ["Varadaraj, Srinivas","Thompson, Bill"],"details":"Lamar University is smack dab in the middle of hurricane alley in Beaumont, Texas. High availability and automatic failover to an alternate data center were key requirements for their CAS deployment. This session will discuss the drivers and architecture of Lamar's multi-site multi-node active/active CAS deployment based on a novel Service Ticket routing configuration. We will also discuss our experiences with deployment and operations, and share lessons learned throughout the process."}, { "title":"Parallel Views: Simpler Ways to Create Complex Language-Instruction Courses","date":"12-Jun-2012","time":"3:45 PM","room":"Conference Center Room 2","track":"Teaching, Learning, Portfolios and Research","level":"Intermediate","type":"Instructional Design","presenters": ["Harris, Trish","Hastings, Sadie "],"details":"Language instruction is one of the more complex challenges for any digital educational environment. How does the same language course perform in both CLE and OAE? This session uses the same language content and pedagogical approach, along with the tools and affordances available in both Sakai platforms, to explore the strengths of each.  "}, { "title":"Teaching & Learning with OAE Working Group","date":"12-Jun-2012","time":"3:45 PM","room":"Tower 1401","track":"Teaching, Learning, Portfolios and Research","level":"All","type":"Development","presenters": ["Hays, Jon","Squillace, Robert","Ward, Lynn"],"details":"The Teaching & Learning with OAE (Sakai Open Academic Environment) working group was formed this past year due to a growing community interest in communicating Teaching & Learning and Portfolio use cases and user needs to the Sakai OAE development effort.  This group consists primarily of instructional designers, faculty, eportfolio experts and user experience designers from within Sakai's teaching & learning and portfolio communities; it includes both representatives of schools currently piloting OAE and of schools currently running CLE.  We will meet at the conference to discuss our efforts over the past several months and how we as a group want to continue to contribute to the design and development of OAE.  This will be an open discussion and everyone is welcome to attend."}, { "title":"The Library and Trunk: A Three-Year Tour","date":"12-Jun-2012","time":"3:45 PM","room":"Conference Center Room 1","track":"Getting Started","level":"Beginner","type":"Library","presenters": ["Strauber, Chris"],"details":"Session will describe Tufts Libraries' involvement in selection and implementation of Sakai in 2011, including: involvement in faculty training; design of library portal page in Libguides and its integration into default templates; definition of the librarian role and modifications to it based on use; creative librarian involvement in courses; results after two semesters of the live system; plans for future development."}, { "title":"Where Do I Send Our RFP? Including Open Source Options In Your \"Procurement\" Process","date":"12-Jun-2012","time":"3:45 PM","room":"Conference Center Room 3","track":"Awareness and Advocacy","level":"All","type":"Administrator/Executive","presenters": ["Masson, Patrick"],"details":"Interest in the acquisition of open source software is not only growing on campuses as an alternative to commercial services, but is also being driven through a variety of external factors, including in some states, government policy (Massachusetts Enterprise Information Technology Acquisition Policy) and even legislation (New Hampshire House Bill, HB418, 2012). While many may desire (even require) open source options be included in their assessment of software on campuses, a standard approach to identify and assess open source applications does not exist. In addition, the procurement processes employed by campuses-typically, Request for Proposals-often favors commercial options.\r\nThis session will discuss approaches available to campuses to ensure equality in the evaluation of software acquisitions, despite the licensing model. The UK's Cabinet Office's Open Source Procurement Toolkit will be introduced as well as experiences from campuses who have already successfully deployed OSS."}, { "title":"If you offer it, will they come?","date":"12-Jun-2012","time":"3:45 PM","room":"Tower 1403","track":"Getting Started","level":"All","type":"Support","presenters": ["Wicker, Steven","Tingen, Jolie "],"details":"Last year, we had a terrific sharing session where we learned a lot from each other regarding our different approaches to training. This will be an opportunity for us to continue the discussion and learn from each other's successes and failures. A few topics to consider for discussion could be:\r\n\r\n* What has your institution done for training? What worked? What did not work?\r\n* Do you train faculty and staff separately or together?\r\n* How do you group training topics?\r\n* Do you offer formal training for your students on Sakai?\r\n* Is your training ?just-in-time?, ?one-on-on?, or done in a formal setting?\r\n* How do you encourage users to come to training?\r\n* What to do about users that do not want training?"}, { "title":"Integrating Google Calendar with Sakai","date":"12-Jun-2012","time":"3:45 PM","room":"Tower 1402","track":"Design and Development","level":"All","type":"Development","presenters": ["Webber, Richard","Haukom, Richard","Li, Lydia"],"details":"Stanford University will be adopting Google Apps for Education in the coming year. We know that our students' number one request is to see all of their course related events and deadlines in a single calendar. Given these drivers we experimented with integrating Google Calendar with Sakai CLE. In a Proof of Concept that will be piloted in the summer, we are attempting to replace the back end of the CLE Schedule Tool with Google Calendar. Our partner in this effort is the Graduate School of Business, that has been piloting Google Apps for the last year. As part of the POC, they are not only providing requirements and users, they are also developing a Google Spreadsheet-based bulk input tool for their class calendars. If we are successful, we intend to provide our findings and code to the Sakai Community.\r\n\r\nWe will outline the strategy for Google Calendar and Google Apps. We will describe the technical design and challenges of the POC and provide our user needs perspective."}, { "title":"Sakai Member Institutions Meeting + Meet the Board","date":"12-Jun-2012","time":"3:45 PM","room":"Tower 1406","track":"Leadership and Future Directions","level":"All","type":"Other / All","presenters": ["Dolphin, Ian"],"details":"An opportunity for those at Sakai Foundation member schools to meet the Board of Directors and Foundation staff. A detailed agenda for the meeting will be advertised in advance."}, { "title":"\\'Sexy\\' Grades on the Phone","date":"13-Jun-2012","time":"9:30 AM","room":"Conference Center Room 4","track":"Design and Development","level":"Intermediate","type":"Development","presenters": ["Helwig, Jim"],"details":"This past winter the Registrar&#146;s Office at the University of Wisconsin-Madison set the goal of delivering grades to students on their smartphones by the end of the spring semester. This was the first step in making it easier for students to access important information currently available only within PeopleSoft. After considering a variety of approaches, they decided to leverage the mobile capabilities of the campus portal. We will discuss the decision making process, system architecture, design process, progress to date and plans for the future. We will highlight the role uPortal and uMobile play."}, { "title":"Development of IMPROV: A Provisioning Solution at UNC-Chapel Hill","date":"13-Jun-2012","time":"9:30 AM","room":"Tower 1401","track":"Design and Development","level":"All","type":"Identity Management","presenters": ["Copeland, Celeste"],"details":"When implementing a Provisioning solution for UNC-Chapel Hill, we found there was very little available in the Open Source ecosystem that addressed this Identity Management problem space. Thus we set about writing our own solution, in the hopes that we would then be able to contribute it back to the community.\r\nWe have nearly completed the first phase of the outcome, a system we call IMPROV (Identity Management Provisioning.)  It consists of a SPML-based router mechanism that interacts with individual Services that provide our login identifiers, the Onyen and the UNC Guest ID.  We intend future phases to include De-provisioning for these identifiers, and Provisioning/De-provisioning for other services such as Heelmail (our Microsoft Live@EDU implementation) and Exchange.\r\nIn this BOF session, we plan to communicate the status of the project, discuss the architecture of IMPROV, and find others who would like to contribute to making this an Open Source project. "}, { "title":"Introduction to the Scheduling Assistant","date":"13-Jun-2012","time":"9:30 AM","room":"Conference Center Room 3","track":"Design and Development","level":"Beginner","type":"Student","presenters": ["Blair, Nicholas"],"details":"The Scheduling Assistant is a web application in the Jasig Incubator that is designed to integrate with your existing Enterprise Calendar Server and provide enhanced appointment scheduling features, much like the appointment slots feature available in Google Calendar.\r\nIn addition, the Scheduling Assistant can connect with your student information system to connect students automatically with their specific instructors and advisors.\r\nThe Scheduling Assistant was developed at the University of Wisconsin-Madison and has been in production since Fall of 2009. Since launch, well over 50,000 appointments have been scheduled for a wide range of use cases: students meeting with advisors or instructors, staff signing up for group technical training, reserving conference rooms and resources, and much more.\r\nSee a demonstration of the Scheduling Assistant's features and discuss its capabilities."}, { "title":"TWSIA Award: Case Study Investigation: Interdisciplinary Study in a Comprehensive Cancer Care Clinic","date":"13-Jun-2012","time":"10:00 AM","room":"Peachtree Ballroom","track":"Teaching, Learning, Portfolios and Research","level":"All","type":"Faculty","presenters": ["Baker, Jamie"],"details":"TWSIA Winner!\r\nThe University of Texas MD Anderson Cancer Center School of Health Professions (SHP) faculty participated in the development and implementation of an interdisciplinary case study involving a fictitious cancer patient, whereby the students applied their professional skills to diagnose or treat the patient. Students at the SHP complete didactic coursework and clinical rotations in eight different allied health fields including clinical laboratory science, cytogenetic technology, cytotechnology, diagnostic imaging, histotechnology, medical dosimetry, molecular genetic technology, or radiation therapy. Student teams worked in interdisciplinary groups composed of students from each discipline to review, diagnose, and treat the fictitious cancer patient in a virtual clinic environment through Sakai. Through this exercise, students gained an understanding of the roles of the various health disciplines and how their training fits within the health care team and with patient care. The presenter will discuss student success results and provide a demo of key course components."}, { "title":"Adapting an Incubation Process for the New Organization","date":"13-Jun-2012","time":"10:45 AM","room":"Tower 1401","track":"Leadership and Future Directions","level":"All","type":"Advocate","presenters": ["Gertz, Patty"],"details":"The Founding Board of the proposed, merged organization calls for a reformulation of the Jasig incubation process to facilitate the journey of a new project to full organizational sponsorship. This discussion will address such questions as what happens to existing projects on both sides, what should the requirements be to obtain  full sponsorship, how do we measure when a project should be terminated? Should communities of interest be handled differently than software communities? If a project graduates from the incubator, what does full sponsorship mean? It might be useful to attend the track session on Incubation if attendees are not familiar with the current Jasig process."}, { "title":"Creating a More Marketable Open Source Suite for Identity Management","date":"13-Jun-2012","time":"10:45 AM","room":"Conference Center Room 3","track":"Awareness and Advocacy","level":"Intermediate","type":"Advocate","presenters": ["Hazelton, Keith","Carter, Rob","Dopirak, Tom"],"details":"Kuali and Internet2 have recently launched an ambitious joint initiative to create and promote a comprehensive new approach to identity and access management (IAM). This session highlights how the initiative enhances the benefits and mitigates the perceived risks of open source, community driven infrastructure solutions. Illustrations will be drawn primarily from the provisioning sub-project. A unique tri-partite \"product\" vision is specifically designed to minimize risks and maximize benefits at institutions that have some large chunks of IAM infrastructure in place but who need to build out new capabilities. 1) A Recipe Book with details on how to approach and solve common IAM challenges 2) Toolkits (software artifacts ranging from simple service modules to whole packages (such as Grouper and Rice KIM) and 3) Demonstration Solutions: Fully worked out and documented \"dishes\" from the recipe book constructed with the help of the toolkits that solve real problems at real institutions."}, { "title":"Student Success Plan - Learner Relationship Management Software - Technology Review","date":"13-Jun-2012","time":"10:45 AM","room":"Conference Center Room 4","track":"Deployment and Integration","level":"Intermediate","type":"Development","presenters": ["Gormley, Shawn"],"details":"The Student Success Plan (SSP) supports and enables processes and interventions designed to increase the persistence, success, and graduation rates of targeted students. Through holistic counseling, web-based support systems, and intervention techniques, students who are at risk of failing in college are identified, supported and monitored. Data is collected and analyzed to make decisions about future efforts. SSP includes case management tools, a journal of contact with students, early alerts, and an individual action plan. A student interface is available to connect with coaches, search resources, use self-help guides and create/review action plans. SSP has a proven and documented track record of success in improving student outcomes. It has been honored with 11 national awards and has been adopted by five other colleges. Session will focus on the technical aspects of SSP, including architecture, integration strategies, and implementation questions."}, { "title":"TWSIA Award: Criminal Theory and Victimization","date":"13-Jun-2012","time":"11:00 AM","room":"Peachtree Ballroom","track":"Teaching, Learning, Portfolios and Research","level":"All","type":"Faculty","presenters": ["Schildkraut, Jaclyn"],"details":"TWSIA Winner!\r\nCrime Theory and Victimization, is an undergraduate Criminal Justice course taught in a face-to-face classroom environment using Sakai to enhance the student experience. This course was offered at Texas State University during the spring term of 2012 (January to May).  The class supplements the main learning objectives of critical thinking and advancing writing skills through the online activities, including forum posts, article blogs, and online study groups. It encourages interaction among the students, which is an underlying strategy designed to encourage networking, a skill they will need once they graduate.  The presenter will discuss student success results with the new course design and provide a demo of key course components."}, { "title":"Can Anyone Use Our Portal?","date":"13-Jun-2012","time":"1:15 PM","room":"Conference Center Room 3","track":"Design and Development","level":"All","type":"Development","presenters": ["Freestone, Tom"],"details":"Everyone wants people to use our university portals. We are careful to make our portals aesthetically pleasing and appropriately branded. Nevertheless, are our portals usable and receptive to users needs? This presentation will cover what is and isn't usability.  We will focus on the benefits of usability to our portal users and on the principles of user-centered design.  Also, we will cover how to use usability studies to improve the interactions between users and our university portals. Lastly, we will share our recent experiences at BYU as we have redesigned our portal to improve user experience."}, { "title":"Effective Models for Adoption in Higher Education","date":"13-Jun-2012","time":"1:15 PM","room":"Conference Center Room 2","track":"Awareness and Advocacy","level":"All","type":"Administrator/Executive","presenters": ["Evans-Marcu, Amber D."],"details":"Amber D. Evans-Marcu (Virginia Tech, rSmart) will present on information obtained in her dissertation research regarding how awareness and adoption are often hindered by assumptions, misconceptions and a general lack of knowledge regarding any innovation. During her research, she unearthed a trove of adoption models specifically for use in higher education. In this session, she will explain how her experience and knowledge to apply a particular diffusion of innovation model, the Concerns Based Adoption Model (CBAM), came to fruition during the VT Transition from Blackboard to Sakai. She will also explain how other models can prove effective against significant resistance that can often arise across campuses from non-technical stakeholders, especially those unfamiliar with the open source ecosystem. \r\nIn this session, Evans-Marcu will explain:\r\n* The importance of models,\r\n* Selecting a model,\r\n* Applying the CBAM model, and\r\n* Pitfalls to avoid."}, { "title":"Learning Analytics: A Panel Debate on the Merits, Methodologies, and Related Issues","date":"13-Jun-2012","time":"1:15 PM","room":"Conference Center Room 1","track":"Leadership and Future Directions","level":"All","type":"Advocate","presenters": ["Lonn, Steve","Baron, Josh","Campbell, W. Gardener","Hedrick, Charles","Thanos, Kim"],"details":"Is Learning Analytics merely another fad in a long line of technology crazes in education? Is there potential for analytics-based approaches to affect change in teaching and learning? What is being measured, how, and are those the right measures? What does this all mean for the kind of information that systems and tools developed within the Sakai and Jasig communities should provide, to whom, when, and how?\r\nThis panel discussion extends and expands an online summer debate and recent conference discussions on the merits, methodologies, and related issues of learning analytics and the relationship of the products and tools produced within the Sakai and Jasig communities. Topics will include measurement in teaching and learning, different analytics methodologies, and how these approaches may inform or influence future tool development. Audience members will be strongly encouraged to engage with the panel and pose their questions and topics for debate."}, { "title":"One Fish, Two Fish, Red Fish, Blue Fish - An Introduction to Grouper","date":"13-Jun-2012","time":"1:15 PM","room":"Conference Center Room 4","track":"Getting Started","level":"Beginner","type":"Identity Management","presenters": ["Thompson, Bill","Patel, Shilen"],"details":"Grouper, a project of the Internet2 Middleware Initiative, is a critical component of an open source identity and access architecture. Built by and for higher education, Grouper's access management and provisioning capabilities are uniquely suited to address the complexity and flexibility required by the modern institution. This session will be an introduction to Grouper. We will discuss Groupers concepts, features, capabilities, and usage scenarios. Come learn what Grouper can do for your campus!"}, { "title":"Sakai OAE - Activity, Collections and Content Authoring","date":"13-Jun-2012","time":"1:15 PM","room":"Peachtree Ballroom","track":"Design and Development","level":"Beginner","type":"Instructional Design","presenters": ["Peck, Sam","Matthijs, Nicolaas"],"details":"A demo of the Sakai OAE 1.3 release, highlighting some of the themes we left the community with at the end of the last annual Sakai conference. This session will showcase the true power of the OAE: to \"Create,\" \"Discuss\" and \"Discover.\" The \"Create\" section will outline the ability to create content intuitively, helping the user stay \"in-flow.\" The \"Discussion\" section highlights various ways to collaboratively communicate, right down to the level of individual annotations as part of the content itself. Finally, the \"Discover\" section touches on a multiple aspects of discovery but primarily various, informative perspectives on activity functionality. This demo will take a look through use cases and scenarios from the perspective of primary personas such as an instructor, researcher and student, while showcasing how the OAE aims to become integral to the academic lives of a large cross-section of people."}, { "title":"Integrating Google Apps for Education in Sakai OAE","date":"13-Jun-2012","time":"1:15 PM","room":"Tower 1401","track":"Design and Development","level":"Intermediate","type":"Development","presenters": ["Hollowgrass, Rachel"],"details":"Students have many compelling options for online content creation and collaboration. Looming large is the free Google Apps suite. Students use these tools to concurrently edit documents, share calendars and manage their email with a rich and flexible client.\r\n\r\nSakai institutions are already implementing Google Apps for Education. As OAE matures, many Google-centric students -- as well as staff and faculty -- will be reluctant to completely give up their life in the Google-verse. In higher-ed's spirit of open collaboration, how can Sakai OAE design teams best integrate these tools? Come see what some institutions are doing, and bring your own ideas to discuss."}, { "title":"TWSIA: An Active-Collaborative Virtual Community Model for Teaching and Learning ICT in Education","date":"13-Jun-2012","time":"2:30 PM","room":"Conference Center Room 2","track":"Teaching, Learning, Portfolios and Research","level":"All","type":"Faculty","presenters": ["Sempere, Javier"],"details":"TWSIA Winner!\r\nSince its creation in 2008, the Valencian International University (VIU) has developed an entirely online teaching methodology using an ecosystem of 2.0 applications with SAKAI at its nerve centre. The purpose of the ICT in Education course is to teach educators how to use Web 2.0 tools to enhance their courses. The innovation used to encourage student engagement and community-building is based on two main aspects: 1. The reorganisation and activation of different resources in the virtual course was used as a strategy to encourage the usability and diversity of attention; 2. The protocol and considerations for 2.0 action in the Sakai forums. Some of the tools used include: A video class integrated through Elluminate; a timeline of activities and study plan; personal tutorials by appointment using Skype; an e-portfolio of theory-practice work and self-assessment on GoogleSites; and information and feedback on task assessment and final marks. The presenter will discuss student success results with the new course design and provide a demo of key course components."}, { "title":"Accessibility and Innovative Design","date":"13-Jun-2012","time":"2:30 PM","room":"Tower 1401","track":"Design and Development","level":"All","type":"Development","presenters": ["Humbert, Joe","Richwine, Brian Richwine"],"details":"Come join the discussion of how accessibility can improve usability for all users without stiffing innovation.\r\nWe will discuss the needs of users with disabilities, the technology they use, and share experiences we have heard from users.\r\nThis a chance to interact and ask questions of the Accessibility Working Group so together we may develop ideas on how to make many of the new and exciting features in Sakai OAE usable to users of assistive technology."}, { "title":"Advanced Delegated-Access Tools for Sakai CLE","date":"13-Jun-2012","time":"2:30 PM","room":"Tower 1403","track":"Design and Development","level":"Advanced","type":"Development","presenters": ["Aggarwal, Maneesha","Holladay, Bryan "],"details":"Columbia University is transitioning 30,000 users from its current CMS to the Sakai CLE. With 17 schools and over 500 departments, the management of \"admin access\" controls to support learning management must be delegated to local support staff. \r\nTo meet this need, a new set of sophisticated delegated-access tools for the Sakai CLE has been developed for use at Columbia. Specifically, the tools can be used to grant access and edit privileges for sites to any user on a global or lesser level (school, department, or subject area) based on the University's course hierarchy. In addition, privileges may be further limited to \"edit\" (similar to the Instructor rile) or \"view-only,\" and to individual tools within course sites.\r\nDelegated access in Sakai CLE has been used at Columbia since January 2012 with more than 300 users with varying levels of privilege such as \"global view\" for Helpdesk staff and \"global edit\" for educational technologists. Academic administration and staff are using these tools effectively to help support instructors, students and academic staff. Similar tools developed locally for use with Columbia's existing Prometheus course-management system have been used successfully for more than 10 years.\r\n"}, { "title":"CLE Team Status Update","date":"13-Jun-2012","time":"2:30 PM","room":"Tower 1402","track":"Leadership and Future Directions","level":"All","type":"Development","presenters": ["Ottenhoff, Sam","Zeckoski, Aaron"],"details":"Find out what the Sakai CLE team has been up to over the past year. We will cover changes to the release process, technical improvements, areas of focus for the team, and some fun JIRA stats. We especially welcome anyone interested in joining and contributing to the CLE team (including QA, Documentors, Developers, SVN admins, JIRA review, etc.)"}, { "title":"Designing Course Sites in Sakai OAE","date":"13-Jun-2012","time":"2:30 PM","room":"Peachtree Ballroom","track":"Teaching, Learning, Portfolios and Research","level":"All","type":"Instructional Design","presenters": ["Bloodworth, Allison","Appert, Lucy","Ziegmann, Michelle"],"details":"Sakai Open Academic Environment (OAE) is the next-generation of Sakai, which embraces a new vision for academic collaboration. New York University (NYU), UC Berkeley, Charles Sturt University, and the University of California's Online Education (UCOE) program are currently running OAE pilots. These institutions will demonstrate their innovative designs (from the perspective of both instructional design and user experience design) for courses in Sakai OAE. NYU will demonstrate templates from portfolio based writing classes, humanities courses, and a science course. UC Berkeley will present their template for standard, provisioned class pages. UCOE will showcase a game-based online course delivered through OAE. Screenshots of courses at Charles Sturt University will also be presented. There will be time for questions & discussion at the end, as well as a related BOF for institutions interested in presenting courses in Sakai OAE at their institution."}, { "title":"Congrats, You\\'ve Migrated! (Now what?)","date":"13-Jun-2012","time":"2:30 PM","room":"Tower 1406","track":"Technical Management","level":"All","type":"Instructional Design","presenters": ["Evans-Marcu, Amber D.","Lee, Reba-Anna"],"details":"Amber D. Evans-Marcu (VT, rSmart) and Reba-Anna Lee (Marist College) present:\r\n* The importance of a post-transition plan,\r\n* Sustaining Training Momentum,\r\n* Re-framing the Sakai conversation to improve instruction,\r\n* Involving Faculty/Staff in Sakai, \r\n* Tips, Tricks, and Try-it's.\r\nVirginia Tech and Marist College return to explain the importance of continuing momentum. Evans-Marcu (VT, rSmart) presents research models to develop a post-transition plan. She teaches you to keep the training fresh and relevant to your audience. She discusses what faculty expectations are and how to re-frame perceptions of Sakai. Lee (Marist) provides details of post-transition life and the importance of planning communication. She shares with you what to expect and what they do to engage faculty. Together, they provide you with methods for re-framing the Sakai conversation, provide tips for how to improve the use of Sakai, and provide a path for faculty and staff to become part of the Sakai community."}, { "title":"Learning Analytics at Michigan: Designing Displays for Advisors, Instructors, and Students","date":"13-Jun-2012","time":"2:30 PM","room":"Conference Center Room 1","track":"Expanded Solutions","level":"All","type":"Development","presenters": ["Lonn, Steve","Kiskis, Daniel"],"details":"Several different teams of researchers and designers are piloting different learning analytics-based approaches to informing teaching and learning at the University of Michigan. In this session, we will present current findings and designs for translating user-level Sakai CLE activities into actionable information displays for academic advisors, instructors, and students. \r\nThe advisor displays have been used since Fall 2011 as part of an early warning system deployed within an undergraduate engineering mentoring program. The instructor displays were piloted with four faculty members in Winter 2012 and will inform a full-scale development effort. Student displays are in a pre-pilot design phase. We will discuss how these efforts align with similar projects at Michigan and how other institutions can build upon our approach. We will also elaborate on the importance of learning analytics-based interventions developed for higher education and beyond."}, { "title":"Open Education Strategies for Student Success","date":"13-Jun-2012","time":"2:30 PM","room":"Conference Center Room 4","track":"Leadership and Future Directions","level":"All","type":"Administrator/Executive","presenters": ["Bettino, M.L.","Thanos, Kim"],"details":"The Kaleidoscope Project brings together colleges that serve predominantly at-risk students to improve student success. The partners use open educational resources and open technologies to improve the success of at-risk learners by creating and improving collaborative, open course designs. Cross-institutional faculty teams share student results and improve the designs to better support learners. Students also benefit from the elimination of textbook costs, a common obstacle for low-income students.\r\nThis session will present the approach and results achieved by the Kaleidoscope Project with an emphasis on the strategic issues such as faculty governance, intellectual property, professional development, cross-institutional collaboration, and sustainability models."}, { "title":"Open Source Person Registries - You want \\'em, we got \\'em!","date":"13-Jun-2012","time":"2:30 PM","room":"Conference Center Room 3","track":"Design and Development","level":"Beginner","type":"Identity Management","presenters": ["Westfall, Eric","Chamberlin, Dedra","Morgan, Bob"],"details":"The Community Identity Framework for Education and Research (CIFER) project is a cross-consortial effort to assemble a comprehensive suite of open source identity and access management solutions for Higher Education. Participants in this initiative include Jasig, Internet2, Kuali, and a few interested universities.\r\nIn this session, you will learn about the progress of the Person Registries work stream since the formation of the initiative. This includes work in the areas of identity match and reconciliation as well as planning for inclusion and development of the Identity Registry component itself. This includes analysis on existing solutions such as OpenRegistry, Kuali Identity Management, and Penn State's person registry. This group has also been working closely with the Provisioning work stream of CIFER to ensure proper integration.\r\nCome to this session and learn about the exciting work the team is doing, and see how it can benefit you and your institution to get involved! "}, { "title":"Sakai Tools that Engage Students","date":"13-Jun-2012","time":"2:30 PM","room":"Tower 1404","track":"Getting Started","level":"Beginner","type":"Instructional Design","presenters": ["Kha, Hong","Phillips, Landon"],"details":"If you are new to Sakai and would like to know how this system can help stimulate active learning in your course then come join our session. We will show you tools in Sakai that encourage active learning. You will see how forums, blogs, and Google docs can be used in a course. In the end, Sakai is still a tool but it is how well you wield that tool that will help your students become active learners. "}, { "title":"The Advantages of Monitoring Sakai Usage","date":"13-Jun-2012","time":"2:30 PM","room":"Conference Center Room 5","track":"Design and Development","level":"All","type":"Identity Management","presenters": ["Silva-Lugo, Jose","Boekenoogen, John","Perry, Carl"],"details":"The University of Florida adopted Sakai CLE as its primary course management system in 2010. This proposal presents the advantages of monitoring Sakai usage at the university level. Our goal is to obtain at least 90% Sakai usage from the majority of colleges. Therefore, an analysis of Sakai usage is needed to determine which colleges are using Sakai. This analysis starts by obtaining the total number of courses that use Sakai per college per semester and comparing this to the comprehensive list from the Registrar Office. With a simple calculation, we are able to plot the percentages of courses that use Sakai per college to identify the colleges with percentages < 50%. The advantages of monitoring Sakai at a university level are: (a) help to monitor the progress of the implementation process, (b) identify the colleges with greater needs, (c) evaluate success at the college and/or university level, and (d) create a database for training and marketing purposes."}, { "title":"CalCentral: Building an \"Academic Commons\"","date":"13-Jun-2012","time":"3:45 PM","room":"Peachtree Ballroom","track":"Leadership and Future Directions","level":"All","type":"Administrator/Executive","presenters": ["Heyer, Oliver","Cochran, Eli","Hancock, Mara"],"details":"UC Berkeley's early implementation strategy for the Sakai OAE was unorthodox. It focused on using the new platform to begin orchestrating a range of critical, but scattered, underutilized, or poorly delivered student services not usually considered part of the LMS domain. The plan remains that as the OAE provides increasingly richer support for teaching, learning, and research, CalCentral, UCB's branding of the OAE, will gradually bring together in one location access to the administrative, social, and academic services most common to student campus life.\r\nThis strategy recognized from the beginning that there would be parallel opportunities to build and organize services tailored to the needs of UCB's faculty and staff. We expect CalCentral to emerge as UCB's online Academic Commons - a place where the entire campus community can engage with each other. The teaching and learning mission creates the nexus.\r\nPlease come hear about the challenges and how we hope to achieve the vision. "}, { "title":"BOF for Learning Analytics: Current and Planned Projects and Tools","date":"13-Jun-2012","time":"3:45 PM","room":"Tower 1401","track":"Expanded Solutions","level":"All","type":"Advocate","presenters": ["Marquard, Stephen","Angell, Nate","Appert, Lucy","Baron, Josh","Brown, Roger","Dorairaj, Madan","Hedrick, Charles","Kiskis, Dan","Lauria, Eitel","Lonn, Steve","Matthijs, Nicolaas","McVay Lynch, Maggie","Nielsen, Milton","Norman, John","Thanos, Kim"],"details":"Is your institution currently piloting, engaged in, planning, or otherwise in preparation for a tool or project involving learning analytics? Come meet others working in this space and discuss various uses of open source tools, products, shared approaches, and lessons learned (sometimes in very hard ways). \r\nLeaders from Marist, Michigan, the Kaleidoscope Project consortium, rSmart, Cape Town, NYU, Cambridge, and others will share their progress. We will also discuss possibilities for future collaboration within the Sakai and Jasig communities and how to best work with designers to leverage CLE and OAE infrastructure and other community-supported tools for learning analytics tools and displays.\r\nFinally, we will discuss how best to summarize and continue the dialogue begun during the conference week through cross-institutional collaboration based on shared and similar approaches, practices, and applications for learning analytics-based techniques. \r\n"}, { "title":"High Stakes Testing with Samigo on a Locked-Down OS Image","date":"13-Jun-2012","time":"3:45 PM","room":"Conference Center Room 1","track":"Teaching, Learning, Portfolios and Research","level":"Beginner","type":"Instructional Design","presenters": ["Romeo, Kenneth","Queisser, Michael"],"details":"The Stanford Language Center delivers writing exit-assessments every year as part of the university's language requirement. Moving from paper to electronic submission offered many benefits, including better security than hand delivery and easier collaboration when scoring.  However, with an internet connection, there was also the possibility of test-takers making use of online translation services. Another dilemma would be concerns that students could potentially access data that other students left on the machine. When the Language Center approached the Academic Computing Services Imaging team to help resolve these dilemmas, they came up with a Windows 7 operating system image that only allowed Internet Explorer access to Sakai on low-cost laptops.  This presentation will give details about how the laptops, the OS image, and Samigo were set up, as well as some of the lessons that were learned in a pilot with 150 students in 19 sections of foreign language courses."}, { "title":"Jasig Portlet Showcase","date":"13-Jun-2012","time":"3:45 PM","room":"Conference Center Room 4","track":"Deployment and Integration","level":"Beginner","type":"Development","presenters": ["Wills, Drew","Bourey, Jen","Colebourne, Anthony"],"details":"Along with uPortal, Jasig also sponsors a comprehensive range of compelling, off-the-shelf portlet projects you can use to assemble an effective campus portal in little time. The last year has been a big one for Jasig portlets: we've seen some exciting new projects, as well as lots of incremental features, improvements, and bug fixes in some of the best known portlets.\r\nThis session will review and showcase these recent developments.  We will discuss:\r\n - New portlets in Jasig\r\n - Development highlights for existing portlets\r\n - The impact of uMobile on Jasig portlets\r\n - JSR-286 portlets (Java Portlet 2.0)\r\n - Emerging patterns for portlet development\r\n - New portlets bundled with uPortal\r\nIf you're thinking of implementing uPortal or uMobile, or if you already have a campus portal based on uPortal and need to catch up with new developments, this session is for you.  This is a high-level, highly visual overview: uPortal and Java platform knowledge is not required."}, { "title":"Link Migration: UVa\\'s Solution to Re-Using Site Content","date":"13-Jun-2012","time":"3:45 PM","room":"Tower 1403","track":"Design and Development","level":"All","type":"Instructional Design","presenters": ["Sigmon, Tim","Firdyiwek, Yitna","Gordon, Trisha"],"details":"One of the challenges of using and re-using content in Sakai has been the problem of migrating embedded links to content and activities from one site to another. The talented team of developers at the University of Virginia has successfully implemented a solution to this link migration problem. This solution allows us to promote the Interactive Syllabus and Lesson Builder tools as sustainable methods for structuring and delivering course content to students from one semester to the next. This session focuses on the development and implementation of the link migration functionality as it applies to the Interactive Syllabus and Lesson Builder tools for links to or embedded in Syllabus, Resources, Assignments, Forums, and Tests & Quizzes. "}, { "title":"Make Your Migration to Sakai Magically Delicious: UNC\\'s Story","date":"13-Jun-2012","time":"3:45 PM","room":"Conference Center Room 2","track":"Getting Started","level":"All","type":"Administrator/Executive","presenters": ["Eke, Kimberly"],"details":"Come to this interactive session to learn how a migration to Sakai can actually be a positive learning experience! We will share our five lessons learned and debunk the most common (flawed) assumptions in planning and executing a change of this magnitude. \r\nLessons learned include:\r\n1. Embrace the Failure Paradox\r\n2. Timing is everything\r\n3. Do the math\r\n4. It's not open heart surgery\r\n5. Delight people\r\nIn addition, we will demonstrate (and share) tools and techniques that helped us along the way including a reporting dashboard and rapid-development tutorial application. UNC's migration to Sakai was formally announced in February 2011 and will be completed by December 2012. "}, { "title":"Moving from SuperTarget to Super Glue: Complementing Sakai with External Tools and Open Content ","date":"13-Jun-2012","time":"3:45 PM","room":"Conference Center Room 3","track":"Teaching, Learning, Portfolios and Research","level":"Intermediate","type":"Instructional Design","presenters": ["Clark, Chris"],"details":"This session explores the metaphor of Sakai as glue, including demonstrations, focus group results, and strategies to enhance learning. We used to encourage faculty to think of a CMS as \"one-stop shopping\" - a SuperTarget for technology needs. Now there is growing interest in a new approach that capitalizes on the strengths of Sakai and uses it as Super Glue to connect external tools.\r\nThe Applied Multimedia course used Sakai for private activities and as a jump page to outside resources. We concentrated on Sakai tools combining security with interactivity: Gradebook, Assignments, and Tests & Quizzes. External tools provided enhancements like drag-and-drop or desktop sync. Box substituted for the Resources tool, Google Apps for Wiki, and WordPress for Blogs.\r\nCourse content was external. Materials at our OCW site included handouts and assignment descriptions, while our library provided free online access to textbooks. Lynda.com tutorials were the only materials students had to pay for!"}, { "title":"Piloting OAE in a First-Year Writing Class: Challenges and Possibilities at NYU","date":"13-Jun-2012","time":"3:45 PM","room":"Conference Center Room 5","track":"Teaching, Learning, Portfolios and Research","level":"All","type":"Faculty","presenters": ["Horng, Susanna","Domine, Paige","Leifeste, Luke","Rennhack, Riley","Solomon, Sarah"],"details":"In academic year 2011-12, professor Susanna Horng participated in New York University's Sakai Open Academic Environment pilot for the portfolio-based Writing 1 and Writing 2 courses she teaches in the university's Liberal Studies Program. She and her students found that the new capabilities offered by OAE opened up both possibilities and challenges. In this session, she and a group of students will discuss their experiences, focusing in particular on the impact the environment's collaborative features and multimedia content authoring had on their coursework. The students will also reflect on the general role instructional technology plays in their academic lives and how OAE compares."}, { "title":"Sakai Course Site Creation and Automation","date":"13-Jun-2012","time":"3:45 PM","room":"Tower 1402","track":"Deployment and Integration","level":"All","type":"Administrator/Executive","presenters": ["Perry, Carl"],"details":"Creating thousands of course sites each semester can be a daunting task.  Add in the fact that individuals and departments have their own unique conventions and requirements.  The workload can really pile up at the beginning of the semester.\r\nThis presentation will overview course site and roster creation and how UF has automated most of this process. This includes the ability to dynamically create course sites from pre-configured template sites. The advantages and disadvantages of different course creation strategies will be highlighted. A technical overview will be given, including specific Java Web Services used to achieve automation. This session will benefit universities who are developing a strategy for creating course sites or are interested in improving their current course creation process. The University of Florida is currently using Sakai CLE 2.7."}, { "title":"Supporting International MyLabs using Sakai","date":"13-Jun-2012","time":"3:45 PM","room":"Tower 1404","track":"Expanded Solutions","level":"Beginner","type":"Faculty","presenters": ["Holdorph, Cris","Rothwell, Tansy"],"details":"Pearson International has chosen to build a new offering using the Sakai Collaboration and Learning Environment to support instructors and students in many different regions around the world, including Japan, Germany, France, Sweden and more. This session will look at why Sakai was chosen, including what is unique to the project and what Sakai offers \"out of the box\". We will also look at what needs Sakai did not meet and what development has been needed. Additionally, we will look at how this project is working with the Sakai community to improve the localization / internationalization support. "}, { "title":"Jasig Business Meeting","date":"13-Jun-2012","time":"3:45 PM","room":"Tower 1406","track":"Leadership and Future Directions","level":"All","type":"Other / All","presenters": ["Haeusser, Jens"],"details":"The annual Jasig membership meeting is a session that is open to all. Members of the Jasig Board of Directors will discuss Jasig status and strategic direction, including the merger with Sakai, recap highlights of the past year, discuss new initiatives, summarize status of the projects and the Jasig Incubator, and take questions from the community."}, { "title":"Integration of Sakai OAE with Grouper at NYU","date":"13-Jun-2012","time":"5:15 PM","room":"Atlanta Ballroom","track":"Deployment and Integration","level":"Intermediate","type":"Identity Management","presenters": ["Dorairaj, Madan"],"details":"NYU's implementation of Sakai OAE is called \"The ATLAS Network\". Our vision is to position ATLAS as the collaboration tool that will provide seamless integration to various academic systems. Towards that end, NYU uses Internet2's group management toolkit for Authorizations. In this session we will take a deep dive into the use case of Grouper where course groups are provisioned in ATLAS using PeopleSoft Student Information Systems. NYU is also interested in extending the capabilities to store ATLAS basic/simple group information and \"My Contacts\" in Grouper thereby utilizing Grouper's true potential as an enterprise group management toolkit. "}, { "title":"Global Alerts Messaging capability","date":"13-Jun-2012","time":"5:15 PM","room":"Atlanta Ballroom","track":"Technical Management","level":"Intermediate","type":"Administrator/Executive","presenters": ["Eng, Jim","Kirschner, Beth","Silverio, Gonzalo"],"details":"The Global Alerts Messaging contrib project provides a way for admins to post messages to sakai users on a single server or on all servers in a cluster. Messages are posted by creating a text document in the resources tool of the special \"Global Alerts Messaging\" site. The messages show up within a minute or so in the portal for users in course and project sites. Global Alerts have been used since November 2011 at the University of Michigan to alert users in advance when a production problem required restart of one or more servers.  They could also be used to alert users to campus security incidents.    "}, { "title":"Introduction to International MyLabs","date":"13-Jun-2012","time":"5:15 PM","room":"Atlanta Ballroom","track":"Expanded Solutions","level":"Beginner","type":"Faculty","presenters": ["Holdorph, Cris","Rothwell, Tansy"],"details":"Pearson International has chosen to build a new offering using the Sakai Collaboration and Learning Environment to support instructors and students in many different regions around the world, including Japan, Germany, France, Sweden and more.  This demo will look at what is unique to the project and what Sakai offers \"out of the box.\""}, { "title":"Japan Sakai ( Ja Sakai ): Benten - Eclipse Plug-in for Community-Based Translations","date":"13-Jun-2012","time":"5:15 PM","room":"Atlanta Ballroom","track":"Design and Development","level":"Advanced","type":"Development","presenters": ["Tokiwa, Yuji"],"details":"In this tech demo, audiences will be able to see how community-based translations to Japanese and/or Espanol will be done on the Eclipse platform. Benten is a one of open source translation tools developed by Java as an Eclipse plug-in. Using Benten for l10n of Sakai 2.9, we translated property files and submitted the results to the Sakai community. This tool is beneficial for those who are in charge of i18n/l10n&#12288;and applicable for other open source software."}, { "title":"Kaltura Sakai Integration Demo","date":"13-Jun-2012","time":"5:15 PM","room":"Atlanta Ballroom","track":"Deployment and Integration","level":"All","type":"Media/Multimedia","presenters": ["Zeckoski, Aaron"],"details":"Managing media (video, audio, images, etc.) for a campus is a complex task. Kaltura provides a solution for encoding and storage of media content which integrates with many popular platforms like Sakai. Come see a demo of the Sakai Kaltura integration for CLE and OAE."}, { "title":"MediaCAST Demonstration","date":"13-Jun-2012","time":"5:15 PM","room":"Atlanta Ballroom","track":"Expanded Solutions","level":"Beginner","type":"Media/Multimedia","presenters": ["Norton, Mark","Webster, Matt"],"details":"Mark Norton and Matt Webster will conduct live demonstrations of MediCAST using a recently developed integration tool in Sakai 2.8.1. \r\nMediaCAST is a digital content management and streaming platform, specifically designed to meet the needs of 21st century educational institutions.  MediaCAST opens up a new set of engaging teaching possibilities by integrating an unlimited amount of publisher content, user-generated content and live streams into Sakai courses. Students and teachers can upload, search and segment resources stored in the MediaCAST centralized library, right from their Sakai course page. MediaCAST is easy-to-use and translates into time and money savings for organizations looking for a way to search all of their content in a single interface as well as manage copyright and licensing information. MediaCAST expands Sakai's feature set to offer clients a way to access all of their video, images, audio files, Power Points, PDFs, whiteboard files and more. "}, { "title":"Multifactor Authentication with CAS Demonstrated (Tech Demo)","date":"13-Jun-2012","time":"5:15 PM","room":"Atlanta Ballroom","track":"Deployment and Integration","level":"Intermediate","type":"Information Security","presenters": ["Petro, Andrew"],"details":"This tech demo will demonstrate a variety of multifactor authentication tokens working with Jasig CAS, including VASCO's DigiPass, Yubico's Yubikey, DuoSecurity's SaaS solution, and Google Authenticator.\r\n(Trademarks property of their respective owners and used here only to identify products and do not imply endorsement.)"}, { "title":"My OHIO uPortal 4 Showcase","date":"13-Jun-2012","time":"5:15 PM","room":"Atlanta Ballroom","track":"Deployment and Integration","level":"Beginner","type":"Development","presenters": ["Wills, Drew"],"details":"Ohio University selected uPortal in Q1 2010 and their uPortal 3.2-based portal has serviced their community ever since. Currently Ohio is migrating to uPortal 4, and the response from beta users has been very positive. Come see hiighlights of Ohio's uPortal 4, including the new list-based mobile navigation from uMobile, new uPortal 4 personalization features, MS Exchange integration, Active Directory integration, Emergency Alerts, and more!"}, { "title":"Open Syllabus","date":"13-Jun-2012","time":"5:15 PM","room":"Atlanta Ballroom","track":"Teaching, Learning, Portfolios and Research","level":"All","type":"Faculty","presenters": ["Montminy, Martin"],"details":"Open Syllabus (OSyl) is a fully functional Sakai 2.7 contrib tool that helps instructors quickly organise their course's material to provide a coherent learning environment for students.  In this tech demo, we sketch the most important features of the tool.  OSyl is easy to use and provides templates to organize all the resources (files, citations, urls, etc.), assessment activities (assignment, quiz, forum, etc.) and other elements (description of the course, etc.).  OSyl is an XML model-based approach to syllabi so all the information is organized and kept in a general semantic format. Simple configuration rules can be set to reflect different university practices. OSyl course websites are very flexible and can be shared, exported, printed and archived easily. Osyl now includes a simple and powerful course site manager to copy course site across semesters."}, { "title":"Sakai + BigBlueButton Demo","date":"13-Jun-2012","time":"5:15 PM","room":"Atlanta Ballroom","track":"Expanded Solutions","level":"All","type":"Advocate","presenters": ["Dixon, Fred","Federico, Jesus"],"details":"BigBlueButton is an open source web conferencing system for distance education. It enables universities and colleges to offer a high-quality learning experience to remote students.  \r\nThe Sakai Meeting Tool enables the instructional designer and teacher to directly create synchronous classrooms within the Sakai CLE environment.\r\nThis demonstration will show the recent updates to the Meeting Tool to support record and playback of on-line classes from within Sakai using BigBlueButton 0.8 (or later).\r\n"}, { "title":"Sakai as Glue: Integrating External Tools and Content","date":"13-Jun-2012","time":"5:15 PM","room":"Atlanta Ballroom","track":"Teaching, Learning, Portfolios and Research","level":"Intermediate","type":"Instructional Design","presenters": ["Clark, Chris"],"details":"Our Applied Multimedia course explored the metaphor of Sakai as glue, holding resources together. We will share statistics, focus group results, and strategies to enhance learning.\r\nExperts used to encourage faculty to think of a CMS as one-stop shopping, but many tools were hard to use, limited, or missing. This course capitalized on the strengths of Sakai and used the course site like glue, to fasten on external resources.\r\nFrom the Sakai toolset we only chose tools combining security with interactivity: Gradebook, Assignments, and Tests & Quizzes. External tools were glued on to provide more robust features like drag-and-drop or desktop sync. Box substituted for the Resources tool, Google Apps for Wiki, and WordPress for Blogs.\r\nNearly all course content was external. We used open courseware to post the syllabus, handouts, assignments, and more. Our library was able to provide free online access to two textbooks, leaving Lynda.com tutorials as the only items students had to pay for!"}, { "title":"Student Success Plan - Learner Relationship Management Software - Demo & Overview of Technology","date":"13-Jun-2012","time":"5:15 PM","room":"Atlanta Ballroom","track":"Design and Development","level":"All","type":"Development","presenters": ["Gormley, Shawn"],"details":"The Student Success Plan (SSP) supports and enables processes and interventions designed to increase the persistence, success, and graduation rates of targeted students. Through holistic counseling, web-based support systems, and intervention techniques, students who are at risk of failing in college are identified, supported and monitored. Data is collected and analyzed to make decisions about future efforts.\r\nSSP includes case management tools, a journal of contact with students, early alerts, and an individual action plan. A student interface is available to connect with coaches, search resources, use self-help guides and create/review action plans.\r\nSSP has a proven and documented track record of success in improving student outcomes. It has been honored with 11 national awards and has been adopted by five other colleges.\r\nCome learn more about SSP, see a demo, discuss implementation, collaboration, and get details on the technology that makes it tick."}, { "title":"The Open Source Portfolio Tools in Sakai","date":"13-Jun-2012","time":"5:15 PM","room":"Atlanta Ballroom","track":"Teaching, Learning, Portfolios and Research","level":"Beginner","type":"Newcomer","presenters": ["Smith, Janice","Ward, Lynn"],"details":"Members of the OSP Community will demonstrate the Open Source Portfolio tools in Sakai and be available to answer functional and technical questions about using portfolios in Sakai. OSP Community members from a variety of institutions and open source portfolio vendors will participate in this technical demonstration. This demo is suitable for all levels of interest and expertise in portfolios. Individual members of the community will work one-on-one with anyone who stops by the tech demo to answer questions or suggest solutions related to the use of portfolios."}, { "title":"uMobile Demo","date":"13-Jun-2012","time":"5:15 PM","room":"Atlanta Ballroom","track":"Deployment and Integration","level":"All","type":"Mobile","presenters": ["Bourey, Jennifer"],"details":"Live demonstration of current uMobile content and features."}, { "title":"Using the Sakai Maven Archetypes to Get Started Creating Tools","date":"13-Jun-2012","time":"5:15 PM","room":"Atlanta Ballroom","track":"Deployment and Integration","level":"All","type":"Development","presenters": ["Jennings, Mike"],"details":"This session will demonstrate how to create a basic Sakai CLE Tool by using the Sakai Spring MVC Maven Archetype. This demonstration will show users how to download and build the Sakai Spring MVC Maven Archetype, generate the initial application, deploy the application into Sakai, import the application into Eclipse, and Debug the deployed application."}, { "title":"Authentic Assessment Using iRubric and Sakai","date":"14-Jun-2012","time":"9:00 AM","room":"Tower 1403","track":"Expanded Solutions","level":"Beginner","type":"Instructional Design","presenters": ["Ramsay, Martin","Sabetiashraf, Ramesh"],"details":"Assessment is an important element in any academic endeavor.  Yet assessment can prove elusive and difficult to implement and to monitor.  Standardized assessments using multiple-choice tests are less effective for authentic assessment than the careful judgement of competencies provided through structured rubrics.  Authentic assessment is also often difficult to integrate seamlessly into commonly-used teaching and learning processes.  This presentation will focus on a solution to these challenges that has worked well for the LAMP Consortium, a group of thirteen small colleges that share a single instance of Sakai CLE.  LAMP's instance of Sakai integrates iRubric into the Gradebook tool, enabling rubric-informed authentic assessment across multiple institutions directly within Sakai.  Come to this presentation to see how iRubric is easily integrated into Sakai CLE and to learn how authentic assessment can be significantly improved through an integrated tool like iRubric."}, { "title":"Balancing Student Privacy & Openness in Sakai\\'s Open Academic Environment","date":"14-Jun-2012","time":"9:00 AM","room":"Peachtree Ballroom","track":"Leadership and Future Directions","level":"All","type":"Administrator/Executive","presenters": ["Hays, Jon","Alpert, Lucy","Fenlason, Clay","Heyer, Oliver","Squillace, Robert"],"details":"UC Berkeley, NYU, and Georgia Tech have worked closely with their faculty and students to pilot early releases of Sakai's Open Academic Environment (OAE) for more than a year. As the name implies, OAE represents a paradigm shift away from many of the assumptions of a traditional learning management system and affords users great freedom to share information about themselves and their work, both within and beyond their institutions. In this session, we will share how we have currently chosen to configure our instances of OAE and describe the upcoming challenges we will face in order to balance our users' needs, our institutional policies, and differing interpretations of FERPA regulations. We intend our presentation to be brief in order to allow sufficient time for a detailed discussion with the session participants on how to support privacy policies and individual needs for privacy while encouraging open collaboration and sharing."}, { "title":"Delivering Mobile Course Content with uMobile","date":"14-Jun-2012","time":"9:00 AM","room":"Conference Center Room 4","track":"Deployment and Integration","level":"All","type":"Mobile","presenters": ["Bourey, Jennifer"],"details":"Today's students increasingly rely on mobile devices for access to university resources.  Jasig's open-source uMobile platform offers a high-quality option for delivering authenticated, personalized content to diverse campus groups. Learn to deliver personalized course content to students and faculty using uMobile.\r\nThis session will discuss options for delivering personalized course content to students and faculty using uMobile.  Topics will include working with existing open-source course integration projects, proxying authentication, and merging information from multiple course data sources. We will also discuss options for extending uMobile with additional custom modules and including external content in the uMobile app."}, { "title":"From CLE to OAE: Bringing Courses into a New Instructional Platform","date":"14-Jun-2012","time":"9:00 AM","room":"Conference Center Room 2","track":"Teaching, Learning, Portfolios and Research","level":"All","type":"Instructional Design","presenters": ["Neugebauer, Ronda","Lynch, Maggie","Thanos, Kim"],"details":"In December 2011 the Kaleidoscope Project made a decision to deliver courses during the Spring 2012 term in rSmart Academic, rSmart's version of Sakai OAE. This required a rapid redesign of nine courses that would be delivered by eighteen faculty members at six different colleges.\r\nIn this session we will share the experience and the lessons learned through this process including the instructional design implications of moving from the CLE to OAE, the practical migration considerations, the faculty experience, the student experience, and new pedagogical possibilities."}, { "title":"Leveraging Student Insights in Designing the Sakai Dashboard","date":"14-Jun-2012","time":"9:00 AM","room":"Tower 1402","track":"Design and Development","level":"Beginner","type":"Instructional Design","presenters": ["Johnston, John","Chow, Tiffany","Holman, Catlin","Sevant, Shwetangi "],"details":"From the earliest days of Sakai, users have wanted a better way to filter what's most important to them in their sakai sites. Students in a graduate-level class in the University of Michigan's School of Information came up with just such a design for a dashboard that would show the most immediate upcoming events and the most recent and/or most important recent activity from all of a user's sakai sites.  Members of Michigan's CTools Integration Group implemented a prototype based on that design, and further refinements resulted from user feedback.  This presentation describes the initial design goals for the dashboard, the process of refining the design to meet user expectations, the current implementation, and hopes for further work, which will enable filtering and tagging to enable customized views for end users."}, { "title":"Sakai CLE Evaluation System: The Journey from Idea to Enterprise-Wide Adoption","date":"14-Jun-2012","time":"9:00 AM","room":"Conference Center Room 1","track":"Teaching, Learning, Portfolios and Research","level":"All","type":"Administrator/Executive","presenters": ["Broniak, Brian","Humphries, Will"],"details":"Going from a general statement of need by a Virginia Tech task force on our end of semester Student Perception of Teaching (SPOT) survey process to full implementation of a university-wide online system is no small endeavor.  This presentation will cover the key aspects our project to do this very thing, including a description of what we've implemented (based upon Sakai EvalSys), how we did this, and the rationale behind several decisions made along the way.  Furthermore, we will look at online course evaluations, and the Sakai tool, from the perspectives of multiple universities at different stages on the adoption timeline. Virginia Tech is at the end of their pilot, while Tufts University is preparing for its first semester of online course evaluations in Sakai. There will be a focus on the lessons learned, and how community members can benefit from other schools learning experiences."}, { "title":"Shibboleth and CAS - Even More Perfect Together ","date":"14-Jun-2012","time":"9:00 AM","room":"Conference Center Room 3","track":"Design and Development","level":"All","type":"Identity Management","presenters": ["Thompson, Bill","Kopylenko, Dmitriy"],"details":"CAS and Shibboleth IdP are commonly combined in campus deployments, with CAS providing the local-to-institution single sign-on and login experience, and Shibboleth providing robust SAML and federation capabilities. This talk will review the current options for combining CAS and Shibboleth, including the traditional REMOTE_USER approach, a more sophisticated approach handling more edge cases better, and a nod to CASShib for Shib-CAS integration in the opposite direction. "}, { "title":"What I\\'ve Learned and Want to Learn as a Developer About Internationalization","date":"14-Jun-2012","time":"9:00 AM","room":"Tower 1401","track":"Design and Development","level":"Beginner","type":"Development","presenters": ["Leveque, Jean-Francois","Swinsburg, Steve"],"details":"Come meet other developers and learn from each other about writing code that will work for every language and country. You can also meet others who need internationalization and ask the questions you have as a developer."}, { "title":"How Star Wars Made Me Look at Training Differently  ","date":"14-Jun-2012","time":"9:00 AM","room":"Tower 1404","track":"Teaching, Learning, Portfolios and Research","level":"All","type":"Support","presenters": ["Haskell, Morgon"],"details":"After working with faculty using Sakai I have realized that there are slight variations on three archetypes of behavior and by association the sites that they create in Sakai. There will always be the beginner, intermediate, and advanced user, but how they develop their sites does not always reflect the subject matter or their skill level. This presentation will examine each archetype with examples of how they use Sakai and what has motivated them in transitioning to Sakai.\r\n-Archetypes with a Star Wars twist:\r\n-Protagonist: Luke and Leia type\r\n-Skeptic: Hans Solo\r\nAdventurous: R2-D2 type\r\nIf you have ever wondered what a Sakai site created by Hans Solo would look like then this presentation is just for you. I do not have a site from Hans Solo, but I have a pretty good idea about what tools he would use, the right questions to ask him, and how to motivate him to transition to Sakai."}, { "title":"Current and Future Portfolio Innovations in Sakai","date":"14-Jun-2012","time":"9:00 AM","room":"Conference Center Room 5","track":"Teaching, Learning, Portfolios and Research","level":"Intermediate","type":"Instructional Design","presenters": ["Smith, Janice","Ward, Lynn"],"details":"A panel of OSP Community members will demonstrate institutional innovations for the portfolio tools in current and future versions of Sakai. Special attention will be given to new functionality available for matrices, portfolio templates, and reports, as well as to new ways of implementing the current software. The session will also include demonstrations from institutions currently designing new portfolio functionality for use in the Sakai Open Academic Environment. This session is designed for those with intermediate or advanced expertise in portfolios, but may be of interest to beginners as well. Expected outcomes for participants include new understanding of different ways to use the portfolios tools in Sakai and advance information about portfolio functionality that will be available in Sakai OAE."}, { "title":"A Shift in Identity Protection Technology: Good or Bad News for Higher Education?","date":"14-Jun-2012","time":"10:15 AM","room":"Conference Center Room 3","track":"Deployment and Integration","level":"Intermediate","type":"Identity Management","presenters": ["Showstead, Andrew"],"details":"For decades higher education institutions have been striving to extend the reach of their identity protection solutions while trying to balance security, cost, and ease of use. With the continuous proliferation of advanced technology the user has become a key element of this paradigm. Users are demanding to learn, collaborate, work, teach and do a myriad other things over the Internet or a mobile network. The practice of \"bring-your-own-device\" (BYOD) is commonplace across campuses; smartphones and tables are about to outnumber PCs. This changes the role of strong authentication from just securing one standard application with one standard device to securing any application, on any platform, with the device of a user's choice.  \r\nWhat does this shift mean for projects like uPortal, uMobile, Sakai, and CAS? In this presentation, we will discuss how multi-factor authentication can simplify user access and password management across campuses while adding security to a multitude of campus resources.\r\n"}, { "title":"Creating an Open Ecosystem for Learner Analytics","date":"14-Jun-2012","time":"10:15 AM","room":"Peachtree Ballroom","track":"Expanded Solutions","level":"Beginner","type":"Administrator/Executive","presenters": ["Baron, Josh","Angell, Nate"],"details":"The Open Academic Analytics Initiative (OAAI), funded under a Next Generation Learning Challenges grant, is building on Purdue University's ground-breaking Course Signals project with the goal of improving our understanding of how to scale analytics across institutions. More specifically, OAAI is engaged in the development of an \"open ecosystem\" for learner analytics that includes the Sakai Collaboration and Learning Environment (CLE), Pentaho open-source business intelligence suite, an open predictive model and intervention strategies that leverage Open Educational Resources (OER). In addition, we are researching the \"portability\" of predictive models between institutions as well as the effectiveness of engaging student in online support communities as a means to improve academic success. To facilitate this work, a \"student effort data\" API for the Sakai CLE, is being developed to automate the extraction of event log and gradebook data required by the predictive model.  "}, { "title":"Making Effective Use of an OAE/CLE Hybrid Implementation","date":"14-Jun-2012","time":"10:15 AM","room":"Tower 1401","track":"Deployment and Integration","level":"Beginner","type":"Advocate","presenters": ["Speelmon, Lance"],"details":"This BOF will provide an informal setting for implementers and potential implementers of a combined OAE/CLE solution to discuss what works, what does not work, what are best practices around implementation, and generally have a Q&A session on the topic."}, { "title":"Open Syllabus Mobile","date":"14-Jun-2012","time":"10:15 AM","room":"Conference Center Room 2","track":"Design and Development","level":"All","type":"Mobile","presenters": ["Raynauld, Jacques"],"details":"HEC Montreal has launched a mobile version of its Sakai CLE Open Syllabus, a contrib tool that organizes all learning resources and activies. According to our students, information relative to courses is dispersed in separate information systems, a major inconvenience for them. Building on the semantic capabilities of Open Syllabus, the mobile version offers a unified gateway to all relevant course information (Sakai,People Soft, etc.). A welcome page lists all the lectures, assignments or exams that are relevant for the current week (with dates, time slots and room numbers). By clicking on a particular lecture, students can check the activities or resources to be done before, during or after class. Students can also look at announcements or browse other lectures of this course or any other one. This mobile version was developed using GWT mobile and Phone Gap and works for iPhone and Android systems. We will report on a pilot conducted. Future versions will integrate other services."}, { "title":"Sakai CLE TCC Update","date":"14-Jun-2012","time":"10:15 AM","room":"Tower 1402","track":"Leadership and Future Directions","level":"All","type":"Administrator/Executive","presenters": ["Zeckoski, Aaron","Jones, Matt"],"details":"The Sakai CLE TCC (Technical Coordination Committee) is a volunteer group which guides and approves changes for the Sakai CLE product. We will cover what has been happening over the past year related to Sakai CLE (including information about the 2.9 release) and what is planned for the future of the CLE. This is also a chance to meet the technical governance group for Sakai CLE and ask questions."}, { "title":"Teaching with Sakai Webinar Series Recap & Review","date":"14-Jun-2012","time":"10:15 AM","room":"Conference Center Room 1","track":"Teaching, Learning, Portfolios and Research","level":"All","type":"Instructional Design","presenters": ["Hays, Jon","Eke, Kimberly","Ellis, Kate"],"details":"At last year's Sakai Conference, several of us at the Teaching & Learning pre-conference were motivated to initiate a new effort to share teaching best practices across our campuses by scheduling community-wide webinars.  The webinars have been a great opportunities for instructors to showcase and discuss their work and have been a popular contribution to our teaching and learning community of practice. In this session we will share highlights from the past year's webinars and discuss how we might improve what we do in the coming year."}, { "title":"Tools for Learner Engagement with Lecture Capture within Online Environments","date":"14-Jun-2012","time":"10:15 AM","room":"Conference Center Room 5","track":"Teaching, Learning, Portfolios and Research","level":"All","type":"Instructional Design","presenters": ["O'Hagan, Brian","Stern, Judy","Ziegmann, Michelle"],"details":"Lecture capture has increasingly become a standard campus offering for students to use as a study tool. But how can students utilize lecture recordings as a learning tool? This presentation highlights an innovative area that is currently being explored by the Opencast Matterhorn project: tools that notate, analyze, and contextualize academic video within online learning environments.\r\nOpencast Matterhorn is an open-source platform to support the management of educational audio and video content. A key part of Matterhorn is its Engage tools/features that enhance learner engagement, including multi-screen viewing, slide segmentation, and in-video search. Institutional projects are in development (ETH Zurich, University of Saskatchewan, Universitat Osnabruck ) that add annotation/note-taking-type tools to Matterhorn. Additional projects that integrate Matterhorn with LMSes, including Sakai CLE and OAE are also underway (University of Capetown, University of California Berkeley).\r\n"}, { "title":"uPortal Showcase","date":"14-Jun-2012","time":"10:15 AM","room":"Conference Center Room 4","track":"Deployment and Integration","level":"All","type":"Development","presenters": ["Helwig, Jim"],"details":"uPortal is a highly powerful and flexible portal framework that institutions have used in a variety of innovative ways to solve very real campus problems. This presentation will showcase several different uPortal implementations demonstrating the diverse ways campuses make use of a central portal. This will also include highlighting several unique portlets deployed at each campus. Finally, we will discuss how each of our institutions has chosen to engage with the uPortal community."}, { "title":"Registration","date":"10-Jun-2012","time":"8:00 AM","room":"zPeachtree Ballroom Foyer","track":"Unknown","level":"Unknown","type":"Event","presenters": [],"details":""}, { "title":"Breakfast","date":"11-Jun-2012","time":"7:30 AM","room":"Atlanta Ballroom","track":"Unknown","level":"Unknown","type":"Event","presenters": [],"details":""}, { "title":"Registration","date":"11-Jun-2012","time":"7:30 AM","room":"zPeachtree Ballroom Foyer","track":"Unknown","level":"Unknown","type":"Event","presenters": [],"details":""}, { "title":"Conference Welcome","date":"11-Jun-2012","time":"8:45 AM","room":"Peachtree Ballroom","track":"Unknown","level":"Unknown","type":"Event","presenters": [],"details":""}, { "title":"Hack-a-thon","date":"11-Jun-2012","time":"9:00 AM","room":"zTower 1405","track":"Unknown","level":"Unknown","type":"Event","presenters": [],"details":""}, { "title":"Lunch","date":"11-Jun-2012","time":"12:00 PM","room":"Atlanta Ballroom","track":"Unknown","level":"Unknown","type":"Event","presenters": [],"details":""}, { "title":"General Session","date":"11-Jun-2012","time":"1:15 PM","room":"Peachtree Ballroom","track":"Unknown","level":"Unknown","type":"Event","presenters": [],"details":""}, { "title":"Welcome Reception","date":"11-Jun-2012","time":"5:30 PM","room":"Atlanta Ballroom","track":"Unknown","level":"Unknown","type":"Event","presenters": [],"details":""}, { "title":"Breakfast","date":"12-Jun-2012","time":"7:30 AM","room":"Atlanta Ballroom","track":"Unknown","level":"Unknown","type":"Event","presenters": [],"details":""}, { "title":"Registration","date":"12-Jun-2012","time":"7:30 AM","room":"zPeachtree Ballroom Foyer","track":"Unknown","level":"Unknown","type":"Event","presenters": [],"details":""}, { "title":"Day Open and Welcome Address","date":"12-Jun-2012","time":"9:00 AM","room":"Peachtree Ballroom","track":"Unknown","level":"Unknown","type":"Event","presenters": [],"details":""}, { "title":"Hack-a-thon","date":"12-Jun-2012","time":"9:00 AM","room":"zTower 1405","track":"Unknown","level":"Unknown","type":"Event","presenters": [],"details":""}, { "title":"Keynote Session","date":"12-Jun-2012","time":"9:30 AM","room":"Peachtree Ballroom","track":"Unknown","level":"Unknown","type":"Event","presenters": [],"details":""}, { "title":"Lunch","date":"12-Jun-2012","time":"12:00 PM","room":"Atlanta Ballroom","track":"Unknown","level":"Unknown","type":"Event","presenters": [],"details":""}, { "title":"Jasig and Sakai Lightning Sessions 1","date":"12-Jun-2012","time":"1:15 PM","room":"Conference Center Room 5","track":"Unknown","level":"Unknown","type":"Event","presenters": [],"details":""}, { "title":"Breakfast","date":"13-Jun-2012","time":"7:30 AM","room":"Atlanta Ballroom","track":"Unknown","level":"Unknown","type":"Event","presenters": [],"details":""}, { "title":"Registration","date":"13-Jun-2012","time":"7:30 AM","room":"zPeachtree Ballroom Foyer","track":"Unknown","level":"Unknown","type":"Event","presenters": [],"details":""}, { "title":"Day Open and Sakai Fellows","date":"13-Jun-2012","time":"8:45 AM","room":"Peachtree Ballroom","track":"Unknown","level":"Unknown","type":"Event","presenters": [],"details":""}, { "title":"Hack-a-thon","date":"13-Jun-2012","time":"9:00 AM","room":"zTower 1405","track":"Unknown","level":"Unknown","type":"Event","presenters": [],"details":""}, { "title":"TWSIA Awards","date":"13-Jun-2012","time":"9:15 AM","room":"Peachtree Ballroom","track":"Unknown","level":"Unknown","type":"Event","presenters": [],"details":""}, { "title":"Lunch","date":"13-Jun-2012","time":"12:00 PM","room":"Atlanta Ballroom","track":"Unknown","level":"Unknown","type":"Event","presenters": [],"details":""}, { "title":"Jasig and Sakai Lightning Sessions 2","date":"13-Jun-2012","time":"1:15 PM","room":"Conference Center Room 5","track":"Unknown","level":"Unknown","type":"Event","presenters": [],"details":""}, { "title":"Tech Demo Reception","date":"13-Jun-2012","time":"5:15 PM","room":"Atlanta Ballroom","track":"Unknown","level":"Unknown","type":"Event","presenters": [],"details":""}, { "title":"Breakfast","date":"14-Jun-2012","time":"7:30 AM","room":"Atlanta Ballroom","track":"Unknown","level":"Unknown","type":"Event","presenters": [],"details":""}, { "title":"Registration","date":"14-Jun-2012","time":"7:30 AM","room":"zPeachtree Ballroom Foyer","track":"Unknown","level":"Unknown","type":"Event","presenters": [],"details":""}, { "title":"Hack-a-thon","date":"14-Jun-2012","time":"9:00 AM","room":"zTower 1405","track":"Unknown","level":"Unknown","type":"Event","presenters": [],"details":""}, { "title":"General Session and Conference Close","date":"14-Jun-2012","time":"11:30 AM","room":"Peachtree Ballroom","track":"Unknown","level":"Unknown","type":"Event","presenters": [],"details":""}]}
